telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
#include <stdbool.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "app.h"
#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_gpio.h"
#include "fsl_lpi2c.h"
#include "fsl_port.h"
#include "fsl_gt911.h"

#include "platform/display_hal.h"
#include "tmf8828_quick.h"

#define TOF_GRID_W 8
#define TOF_GRID_H 8

#define TOF_CELL_PX   9
#define TOF_CELL_GAP  1
#define TOF_CELL_INSET 1
#define TOF_STATUS_H 0
#define TOF_Q_W (TOF_LCD_W / 3)
#define TOF_Q1_X0 0
#define TOF_Q1_X1 (TOF_Q_W - 1)
#define TOF_Q1_TOP_Y0 0
#define TOF_Q1_TOP_Y1 ((TOF_LCD_H / 2) - 1)
#define TOF_Q1_BOT_Y0 (TOF_Q1_TOP_Y1 + 1)
#define TOF_Q1_BOT_Y1 (TOF_LCD_H - 1)
#define TOF_TP_X0 (TOF_Q_W + 1)
#define TOF_TP_X1 (TOF_LCD_W - 1)
#define TOF_TP_Y0 0
#define TOF_TP_Y1 (TOF_LCD_H - 1)
#define TOF_LOCKED_NEAR_MM 50u
#define TOF_LOCKED_FAR_MM  120u
#define TOF_HEATMAP_DARK_MM 100u
#define TOF_STALE_LIMIT_FRAMES 120u
#define TOF_RESTART_LIMIT_FRAMES 300u
#define TOF_REINIT_LIMIT_FRAMES 600u
#define TOF_ZERO_FRAME_RESTART_FRAMES 120u
#define TOF_ZERO_FRAME_RESTART_COOLDOWN_FRAMES 60u
#define TOF_ZERO_FRAME_REINIT_FRAMES 600u
#define TOF_INVALID_HOLD_FRAMES 48u
#define TOF_MEAN_FILL_MIN_VALID 6u
#define TOF_DISPLAY_HOLD_FRAMES 120u
#define TOF_FLAT_VALID_MIN      20u
#define TOF_FLAT_SPREAD_MM      220u
#define TOF_FLAT_CLAMP_MM       40u

#ifndef TOF_DEBUG_RAW_DRAW
#define TOF_DEBUG_RAW_DRAW 1
#endif

#if TOF_DEBUG_RAW_DRAW
#define TOF_FRAME_US  2000u
#else
#define TOF_FRAME_US  12000u
#endif

#if TOF_DEBUG_RAW_DRAW
#define TOF_ENABLE_AUTO_RECOVERY 0u
#else
#define TOF_ENABLE_AUTO_RECOVERY 1u
#endif

#define TOF_READ_BURST_MAX 8u
#define TOF_DRAW_ON_COMPLETE_ONLY 1u
#define TOF_USE_DYNAMIC_RANGE 0u
#define TOF_RESPONSE_TARGET_US 500000u
#define TOF_DEBUG_UPDATE_US 200000u
#define TOF_DEBUG_UPDATE_TICKS_RAW ((TOF_DEBUG_UPDATE_US + TOF_FRAME_US - 1u) / TOF_FRAME_US)
#define TOF_DEBUG_UPDATE_TICKS ((TOF_DEBUG_UPDATE_TICKS_RAW > 0u) ? TOF_DEBUG_UPDATE_TICKS_RAW : 1u)
#define TOF_MAX_DRAW_GAP_TICKS_RAW ((TOF_RESPONSE_TARGET_US + TOF_FRAME_US - 1u) / TOF_FRAME_US)
#define TOF_MAX_DRAW_GAP_TICKS ((TOF_MAX_DRAW_GAP_TICKS_RAW > 0u) ? TOF_MAX_DRAW_GAP_TICKS_RAW : 1u)
#define TOF_TP_UPDATE_US 20000u
#define TOF_TP_UPDATE_TICKS_RAW ((TOF_TP_UPDATE_US + TOF_FRAME_US - 1u) / TOF_FRAME_US)
#define TOF_TP_UPDATE_TICKS ((TOF_TP_UPDATE_TICKS_RAW > 0u) ? TOF_TP_UPDATE_TICKS_RAW : 1u)

#define TOF_DBG_SCALE 2
#define TOF_DBG_CHAR_W 3
#define TOF_DBG_CHAR_H 5
#define TOF_DBG_CHAR_ADV ((TOF_DBG_CHAR_W * TOF_DBG_SCALE) + 2)
#define TOF_DBG_LINE_H ((TOF_DBG_CHAR_H * TOF_DBG_SCALE) + 2)
#define TOF_DBG_LINES 6u
#define TOF_DBG_COLS 19u

#define TOF_TP_MM_FULL_NEAR 35u
#define TOF_TP_MM_EMPTY_FAR 60u
#define TOF_TP_MM_CLIP_MIN TOF_TP_MM_FULL_NEAR
#define TOF_TP_MM_CLIP_MAX 120u
#define TOF_TP_MM_SHIFT (0)
#define TOF_TP_MM_GAIN_Q8 256u /* 1.00x gain to preserve full->empty spread */
#define TOF_AI_PILL_H 20
#define TOF_AI_PILL_MARGIN_X 4
#define TOF_AI_PILL_MARGIN_BOTTOM 4
#define TOF_ALERT_PILL_H 20
#define TOF_ALERT_PILL_GAP_Y 6
#define TOF_ALERT_POPUP_US 3000000u
#define TOF_ALERT_POPUP_TICKS_RAW ((TOF_ALERT_POPUP_US + TOF_FRAME_US - 1u) / TOF_FRAME_US)
#define TOF_ALERT_POPUP_TICKS ((TOF_ALERT_POPUP_TICKS_RAW > 0u) ? TOF_ALERT_POPUP_TICKS_RAW : 1u)
#define TOF_ALERT_POPUP_X_MARGIN 18
#define TOF_ALERT_POPUP_W_PCT 80
#define TOF_ALERT_POPUP_H 81
#define TOF_ALERT_POPUP_GAP_Y 6
#define TOF_TP_BAR_MARGIN_X 12
#define TOF_TP_BAR_H 18
#define TOF_TP_STATUS_H 16
#define TOF_TP_STATUS_GAP_Y 6
#define TOF_ROLL_MEDIUM_TRIGGER_MM TOF_TP_MM_FULL_NEAR
#define TOF_ROLL_LOW_TRIGGER_MM 50u
#define TOF_ROLL_EMPTY_TRIGGER_MM 60u
#define TOF_ROLL_MEDIUM_MIN_Q10 358u  /* 35% */
#define TOF_ROLL_FULL_MIN_Q10 768u    /* 75% */
#define TOF_AI_MODEL_MM_BIAS 0u
#define TOF_ROLL_FULL_CAPTURE_MM (TOF_TP_MM_FULL_NEAR + 8u)
#define TOF_ROLL_FULL_REARM_STREAK 2u
#define TOF_TP_BAR_MM_EMPTY TOF_ROLL_EMPTY_TRIGGER_MM
#define TOF_TP_ROLL_REDRAW_MM_DELTA 2u
#define TOF_TP_CURVE_ROWS_PICK 4u
#define TOF_TP_CURVE_EDGE_GUARD_COLS 1u
#define TOF_TP_CURVE_MIN_ROWS 4u

#define TOF_EST_ENABLE 1u
#define TOF_EST_VALID_MIN 10u
#define TOF_EST_SPREAD_GOOD_MM 120u
#define TOF_EST_SPREAD_BAD_MM 700u
#define TOF_EST_FAST_DELTA_MM 8u
#define TOF_EST_CONF_TRAIN_MIN_Q10 700u
#define TOF_EST_NEAR_MIN_MM 40u
#define TOF_EST_NEAR_MAX_MM 70u
#define TOF_EST_FAR_MIN_MM 90u
#define TOF_EST_FAR_MAX_MM 120u
#define TOF_EST_MIN_GAP_MM 25u
#define TOF_AI_GRID_ENABLE 1u
#define TOF_AI_GRID_NEIGHBOR_MIN 2u
#define TOF_AI_GRID_OUTLIER_MM_MIN 16u
#define TOF_AI_GRID_OUTLIER_MM_MAX 80u
#define TOF_AI_GRID_FAST_DELTA_MM 10u
#define TOF_AI_GRID_HOLD_FRAMES 24u
#define TOF_CORNER_REPAIR_DELTA_MM 72u
#define TOF_TOUCH_I2C LPI2C2
#define TOF_TOUCH_I2C_SUBADDR_SIZE 2u
#define TOF_TOUCH_POLL_US 20000u
#define TOF_TOUCH_POLL_TICKS_RAW ((TOF_TOUCH_POLL_US + TOF_FRAME_US - 1u) / TOF_FRAME_US)
#define TOF_TOUCH_POLL_TICKS ((TOF_TOUCH_POLL_TICKS_RAW > 0u) ? TOF_TOUCH_POLL_TICKS_RAW : 1u)
#define TOF_TOUCH_POINTS 5u
#define TOF_TOUCH_INT_PORT PORT4
#define TOF_TOUCH_INT_PIN 6u

#ifndef TOF_AI_DATA_LOG_ENABLE
#define TOF_AI_DATA_LOG_ENABLE 1u
#endif
#ifndef TOF_AI_DATA_LOG_FULL_FRAME
#define TOF_AI_DATA_LOG_FULL_FRAME 0u
#endif
#define TOF_AI_DATA_LOG_INTERVAL_TICKS TOF_TP_UPDATE_TICKS

#define TOF_INPUT_MODE_LIVE          0u
#define TOF_INPUT_MODE_SYNTH_FIXED   1u
#define TOF_INPUT_MODE_SYNTH_SUBCAP  2u

#ifndef TOF_DEBUG_INPUT_MODE
#define TOF_DEBUG_INPUT_MODE TOF_INPUT_MODE_LIVE
#endif

#ifndef TOF_SYNTH_MAP_MODE
#define TOF_SYNTH_MAP_MODE 0u
#endif

#ifndef TOF_SYNTH_TRACE_EVERY_COMPLETE
#define TOF_SYNTH_TRACE_EVERY_COMPLETE 12u
#endif

#if defined(__GNUC__)
#define TOF_UNUSED __attribute__((unused))
#else
#define TOF_UNUSED
#endif

typedef struct
{
    int16_t x0;
    int16_t y0;
    int16_t x1;
    int16_t y1;
    int16_t ix0;
    int16_t iy0;
    int16_t ix1;
    int16_t iy1;
} tof_cell_rect_t;

typedef enum
{
    kTofRollAlertFull = 0,
    kTofRollAlertMedium = 1,
    kTofRollAlertLow = 2,
    kTofRollAlertEmpty = 3,
} tof_roll_alert_level_t;

static tof_cell_rect_t s_cells[64];
static uint16_t s_filtered_mm[64];
static uint16_t s_display_mm[64];
static uint16_t s_last_cell_color[64];
static bool s_cell_drawn[64];
static uint8_t s_invalid_age[64];
static uint8_t s_display_age[64];

static uint16_t s_ui_bg;
static uint16_t s_ui_border;
static uint16_t s_ui_hot;
static uint16_t s_ui_pick;
static uint16_t s_ui_invalid;
static uint16_t s_ui_below_range;
static uint16_t s_ui_above_range;
static int32_t s_hot_idx = -1;
static int16_t s_curve_pick_idx[TOF_GRID_H];
static int16_t s_curve_prev_pick_idx[TOF_GRID_H];
static uint16_t s_ui_dbg_bg;
static uint16_t s_ui_dbg_fg;
static uint16_t s_ui_dbg_dim;
static int16_t s_dbg_x0;
static int16_t s_dbg_y0;
static int16_t s_dbg_x1;
static int16_t s_dbg_y1;
static bool s_dbg_force_redraw = true;
static char s_dbg_prev[TOF_DBG_LINES][TOF_DBG_COLS + 1u];
static uint32_t s_dbg_last_tick = 0u;
static int16_t s_ai_pill_x0 = 0;
static int16_t s_ai_pill_y0 = 0;
static int16_t s_ai_pill_x1 = 0;
static int16_t s_ai_pill_y1 = 0;
static bool s_ai_pill_prev_valid = false;
static bool s_ai_pill_prev_on = false;
static int16_t s_alert_pill_x0 = 0;
static int16_t s_alert_pill_y0 = 0;
static int16_t s_alert_pill_x1 = 0;
static int16_t s_alert_pill_y1 = 0;
static bool s_alert_pill_prev_valid = false;
static bool s_alert_pill_prev_on = true;
static bool s_tp_force_redraw = true;
static uint32_t s_tp_last_tick = 0u;
static uint16_t s_tp_last_outer_ry = 0u;
static uint16_t s_tp_last_outer_rx = 0u;
static uint16_t s_tp_last_fullness_q10 = 0u;
static uint32_t s_tp_last_roll_mm_q8 = 0u;
static uint32_t s_tp_mm_q8 = 0u;
static uint16_t s_tp_live_actual_mm = 0u;
static uint16_t s_tp_live_closest_mm = 0u;
static bool s_tp_last_live = false;
static bool s_tp_prev_rect_valid = false;
static int16_t s_tp_prev_x0 = 0;
static int16_t s_tp_prev_y0 = 0;
static int16_t s_tp_prev_x1 = 0;
static int16_t s_tp_prev_y1 = 0;
static uint32_t s_ai_log_last_tick = 0u;
static gt911_handle_t s_touch_handle;
static bool s_touch_ready = false;
static bool s_touch_was_down = false;
static uint32_t s_touch_last_poll_tick = 0u;
static bool s_ai_runtime_on = (TOF_AI_DATA_LOG_ENABLE != 0u);
static uint16_t s_est_near_mm = TOF_TP_MM_FULL_NEAR;
static uint16_t s_est_far_mm = TOF_TP_MM_EMPTY_FAR;
static uint32_t s_est_mm_q8 = 0u;
static uint16_t s_est_conf_q10 = 0u;
static uint16_t s_est_fullness_q10 = 640u;
static uint32_t s_est_valid_count = 0u;
static uint16_t s_est_spread_mm = 0u;
static uint16_t s_roll_fullness_q10 = 640u;
static uint16_t s_roll_model_mm = 0u;
static bool s_alert_runtime_on = false;
static tof_roll_alert_level_t s_roll_alert_prev_level = kTofRollAlertFull;
static bool s_roll_alert_prev_valid = false;
static tof_roll_alert_level_t s_roll_status_prev_level = kTofRollAlertFull;
static bool s_roll_status_prev_valid = false;
static bool s_roll_status_prev_live = false;
static bool s_alert_popup_active = false;
static bool s_alert_popup_prev_drawn = false;
static bool s_alert_popup_rearm_on_full = true;
static bool s_alert_popup_hold_empty = false;
static bool s_alert_low_popup_shown = false;
static uint8_t s_roll_full_rearm_streak = 0u;
static tof_roll_alert_level_t s_alert_popup_level = kTofRollAlertLow;
static tof_roll_alert_level_t s_alert_popup_prev_level = kTofRollAlertLow;
static uint32_t s_alert_popup_until_tick = 0u;
static bool s_alert_popup_last_live = false;
static int16_t s_alert_popup_prev_x0 = 0;
static int16_t s_alert_popup_prev_y0 = 0;
static int16_t s_alert_popup_prev_x1 = 0;
static int16_t s_alert_popup_prev_y1 = 0;
static uint16_t s_ai_grid_mm[64];
static uint8_t s_ai_grid_hold_age[64];
static uint16_t s_ai_grid_noise_mm = 0u;

static uint16_t s_range_near_mm = TOF_LOCKED_NEAR_MM;
static uint16_t s_range_far_mm = TOF_LOCKED_FAR_MM;
static uint16_t s_synth_subcap_frame[64];
static uint8_t s_synth_subcap_capture = 0u;

static void tof_ai_grid_reset(void);
static void tof_tp_bar_rect(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1);
static void tof_tp_status_rect(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1);
static uint16_t tof_tp_bg_color(uint32_t t, bool live_data);
static void tof_tp_fill_bg_rect(int32_t x0, int32_t y0, int32_t x1, int32_t y1, bool live_data);
static void tof_draw_roll_status_banner(tof_roll_alert_level_t level, bool live_data);
static void tof_ai_denoise_heatmap_frame(const uint16_t in_mm[64], uint16_t out_mm[64], bool live_data);
static uint16_t tof_ai_grid_median_u16(uint16_t *values, uint32_t count);
static void tof_tiny_draw_char_scaled_clipped(int32_t x,
                                              int32_t y,
                                              char ch,
                                              uint16_t color,
                                              uint32_t scale,
                                              int32_t clip_x0,
                                              int32_t clip_y0,
                                              int32_t clip_x1,
                                              int32_t clip_y1);

static bool tof_mm_valid(uint16_t mm)
{
    return (mm > 0u && mm < 12000u);
}

