telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
static inline uint16_t pack_rgb565(uint32_t r8, uint32_t g8, uint32_t b8)
{
    if (r8 > 255u) r8 = 255u;
    if (g8 > 255u) g8 = 255u;
    if (b8 > 255u) b8 = 255u;
    uint16_t r = (uint16_t)(r8 >> 3);
    uint16_t g = (uint16_t)(g8 >> 2);
    uint16_t b = (uint16_t)(b8 >> 3);
    return (uint16_t)((r << 11) | (g << 5) | b);
}

static uint16_t tof_color_from_mm(uint16_t mm, uint16_t near_mm, uint16_t far_mm)
{
    if (!tof_mm_valid(mm))
    {
        return s_ui_invalid;
    }

    uint16_t color_far_mm = far_mm;
    if (color_far_mm > TOF_HEATMAP_DARK_MM)
    {
        color_far_mm = TOF_HEATMAP_DARK_MM;
    }

    if (color_far_mm <= near_mm)
    {
        color_far_mm = (uint16_t)(near_mm + 1u);
    }

    if (mm < near_mm)
    {
        return s_ui_below_range;
    }

    if (mm > color_far_mm)
    {
        return s_ui_above_range;
    }

    uint32_t t = 0u;
    if (mm <= near_mm)
    {
        t = 0u;
    }
    else if (mm >= color_far_mm)
    {
        t = 255u;
    }
    else
    {
        t = (uint32_t)(((uint32_t)(mm - near_mm) * 255u) / (color_far_mm - near_mm));
    }

    uint32_t r = 0u;
    uint32_t g = 0u;
    uint32_t b = 0u;
    if (t < 128u)
    {
        const uint32_t u = t * 2u;
        r = (u * 220u) / 255u;
        g = 220u - ((u * 40u) / 255u);
        b = 0u;
    }
    else
    {
        const uint32_t u = (t - 128u) * 2u;
        r = 220u - ((u * 164u) / 255u);
        g = 180u - ((u * 172u) / 255u);
        b = (u * 8u) / 255u;
    }

    return pack_rgb565(r, g, b);
}

static void tof_fill_display_holes(const uint16_t in_mm[64], uint16_t out_mm[64])
{
    memcpy(out_mm, in_mm, sizeof(uint16_t) * 64u);

    for (uint32_t pass = 0u; pass < 2u; pass++)
    {
        uint16_t src[64];
        memcpy(src, out_mm, sizeof(src));

        for (uint32_t y = 0u; y < TOF_GRID_H; y++)
        {
            for (uint32_t x = 0u; x < TOF_GRID_W; x++)
            {
                const uint32_t idx = (y * TOF_GRID_W) + x;
                if (tof_mm_valid(src[idx]))
                {
                    continue;
                }

                uint32_t sum = 0u;
                uint32_t count = 0u;
                for (int32_t dy = -1; dy <= 1; dy++)
                {
                    for (int32_t dx = -1; dx <= 1; dx++)
                    {
                        if (dx == 0 && dy == 0)
                        {
                            continue;
                        }

                        const int32_t nx = (int32_t)x + dx;
                        const int32_t ny = (int32_t)y + dy;
                        if (nx < 0 || nx >= TOF_GRID_W || ny < 0 || ny >= TOF_GRID_H)
                        {
                            continue;
                        }

                        const uint16_t v = src[(uint32_t)ny * TOF_GRID_W + (uint32_t)nx];
                        if (tof_mm_valid(v))
                        {
                            sum += v;
                            count++;
                        }
                    }
                }

                if (count > 0u)
                {
                    out_mm[idx] = (uint16_t)(sum / count);
                }
            }
        }
    }
}

static void tof_repair_corner_one(uint16_t mm[64], uint32_t corner_idx, uint32_t n0, uint32_t n1, uint32_t n2)
{
    uint32_t sum = 0u;
    uint32_t count = 0u;
    const uint16_t v0 = mm[n0];
    const uint16_t v1 = mm[n1];
    const uint16_t v2 = mm[n2];

    if (tof_mm_valid(v0))
    {
        sum += v0;
        count++;
    }
    if (tof_mm_valid(v1))
    {
        sum += v1;
        count++;
    }
    if (tof_mm_valid(v2))
    {
        sum += v2;
        count++;
    }

    if (count < 2u)
    {
        return;
    }

    const uint16_t neighbor_mm = (uint16_t)((sum + (count / 2u)) / count);
    const uint16_t corner_mm = mm[corner_idx];
    const uint16_t delta_mm = (corner_mm > neighbor_mm) ? (uint16_t)(corner_mm - neighbor_mm) : (uint16_t)(neighbor_mm - corner_mm);
    if (!tof_mm_valid(corner_mm) || delta_mm > TOF_CORNER_REPAIR_DELTA_MM)
    {
        mm[corner_idx] = neighbor_mm;
    }
}

static void tof_repair_corner_blindspots(uint16_t mm[64])
{
    const uint32_t top_left = 0u;
    const uint32_t top_right = (TOF_GRID_W - 1u);
    const uint32_t bot_left = ((TOF_GRID_H - 1u) * TOF_GRID_W);
    const uint32_t bot_right = (TOF_GRID_H * TOF_GRID_W) - 1u;

    tof_repair_corner_one(mm, top_left, 1u, TOF_GRID_W, TOF_GRID_W + 1u);
    tof_repair_corner_one(mm, top_right, TOF_GRID_W - 2u, (2u * TOF_GRID_W) - 2u, (2u * TOF_GRID_W) - 1u);
    tof_repair_corner_one(mm, bot_left, (TOF_GRID_H - 2u) * TOF_GRID_W, ((TOF_GRID_H - 2u) * TOF_GRID_W) + 1u, ((TOF_GRID_H - 1u) * TOF_GRID_W) + 1u);
    tof_repair_corner_one(mm, bot_right, (TOF_GRID_H * TOF_GRID_W) - 2u, ((TOF_GRID_H - 1u) * TOF_GRID_W) - 2u, ((TOF_GRID_H - 1u) * TOF_GRID_W) - 1u);
}

static int32_t tof_clamp_i32(int32_t v, int32_t lo, int32_t hi)
{
    if (v < lo)
    {
        return lo;
    }
    if (v > hi)
    {
        return hi;
    }
    return v;
}

static void tof_dbg_get_glyph(char ch, uint8_t rows[TOF_DBG_CHAR_H])
{
    if (ch >= 'a' && ch <= 'z')
    {
        ch = (char)(ch - ('a' - 'A'));
    }

    switch (ch)
    {
        case '0': rows[0] = 0x7; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x7; break;
        case '1': rows[0] = 0x2; rows[1] = 0x6; rows[2] = 0x2; rows[3] = 0x2; rows[4] = 0x7; break;
        case '2': rows[0] = 0x7; rows[1] = 0x1; rows[2] = 0x7; rows[3] = 0x4; rows[4] = 0x7; break;
        case '3': rows[0] = 0x7; rows[1] = 0x1; rows[2] = 0x7; rows[3] = 0x1; rows[4] = 0x7; break;
        case '4': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x1; rows[4] = 0x1; break;
        case '5': rows[0] = 0x7; rows[1] = 0x4; rows[2] = 0x7; rows[3] = 0x1; rows[4] = 0x7; break;
        case '6': rows[0] = 0x7; rows[1] = 0x4; rows[2] = 0x7; rows[3] = 0x5; rows[4] = 0x7; break;
        case '7': rows[0] = 0x7; rows[1] = 0x1; rows[2] = 0x2; rows[3] = 0x2; rows[4] = 0x2; break;
        case '8': rows[0] = 0x7; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x5; rows[4] = 0x7; break;
        case '9': rows[0] = 0x7; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x1; rows[4] = 0x7; break;
        case 'A': rows[0] = 0x2; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'B': rows[0] = 0x6; rows[1] = 0x5; rows[2] = 0x6; rows[3] = 0x5; rows[4] = 0x6; break;
        case 'C': rows[0] = 0x3; rows[1] = 0x4; rows[2] = 0x4; rows[3] = 0x4; rows[4] = 0x3; break;
        case 'D': rows[0] = 0x6; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x6; break;
        case 'E': rows[0] = 0x7; rows[1] = 0x4; rows[2] = 0x6; rows[3] = 0x4; rows[4] = 0x7; break;
        case 'F': rows[0] = 0x7; rows[1] = 0x4; rows[2] = 0x6; rows[3] = 0x4; rows[4] = 0x4; break;
        case 'G': rows[0] = 0x3; rows[1] = 0x4; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x3; break;
        case 'H': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'I': rows[0] = 0x7; rows[1] = 0x2; rows[2] = 0x2; rows[3] = 0x2; rows[4] = 0x7; break;
        case 'J': rows[0] = 0x1; rows[1] = 0x1; rows[2] = 0x1; rows[3] = 0x5; rows[4] = 0x2; break;
        case 'K': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x6; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'L': rows[0] = 0x4; rows[1] = 0x4; rows[2] = 0x4; rows[3] = 0x4; rows[4] = 0x7; break;
        case 'M': rows[0] = 0x5; rows[1] = 0x7; rows[2] = 0x7; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'N': rows[0] = 0x5; rows[1] = 0x7; rows[2] = 0x7; rows[3] = 0x7; rows[4] = 0x5; break;
        case 'O': rows[0] = 0x2; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x2; break;
        case 'P': rows[0] = 0x6; rows[1] = 0x5; rows[2] = 0x6; rows[3] = 0x4; rows[4] = 0x4; break;
        case 'Q': rows[0] = 0x2; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x2; rows[4] = 0x1; break;
        case 'R': rows[0] = 0x6; rows[1] = 0x5; rows[2] = 0x6; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'S': rows[0] = 0x3; rows[1] = 0x4; rows[2] = 0x2; rows[3] = 0x1; rows[4] = 0x6; break;
        case 'T': rows[0] = 0x7; rows[1] = 0x2; rows[2] = 0x2; rows[3] = 0x2; rows[4] = 0x2; break;
        case 'U': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x7; break;
        case 'V': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x5; rows[3] = 0x5; rows[4] = 0x2; break;
        case 'W': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x7; rows[3] = 0x7; rows[4] = 0x5; break;
        case 'X': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x2; rows[3] = 0x5; rows[4] = 0x5; break;
        case 'Y': rows[0] = 0x5; rows[1] = 0x5; rows[2] = 0x2; rows[3] = 0x2; rows[4] = 0x2; break;
        case 'Z': rows[0] = 0x7; rows[1] = 0x1; rows[2] = 0x2; rows[3] = 0x4; rows[4] = 0x7; break;
        case ':': rows[0] = 0x0; rows[1] = 0x2; rows[2] = 0x0; rows[3] = 0x2; rows[4] = 0x0; break;
        case '.': rows[0] = 0x0; rows[1] = 0x0; rows[2] = 0x0; rows[3] = 0x0; rows[4] = 0x2; break;
        case '-': rows[0] = 0x0; rows[1] = 0x0; rows[2] = 0x7; rows[3] = 0x0; rows[4] = 0x0; break;
        case '/': rows[0] = 0x1; rows[1] = 0x1; rows[2] = 0x2; rows[3] = 0x4; rows[4] = 0x4; break;
        case '=': rows[0] = 0x0; rows[1] = 0x7; rows[2] = 0x0; rows[3] = 0x7; rows[4] = 0x0; break;
        case ' ': rows[0] = 0x0; rows[1] = 0x0; rows[2] = 0x0; rows[3] = 0x0; rows[4] = 0x0; break;
        default:  rows[0] = 0x7; rows[1] = 0x1; rows[2] = 0x2; rows[3] = 0x0; rows[4] = 0x2; break;
    }
}

static void tof_tiny_draw_char_clipped(int32_t x,
                                       int32_t y,
                                       char ch,
                                       uint16_t color,
                                       int32_t clip_x0,
                                       int32_t clip_y0,
                                       int32_t clip_x1,
                                       int32_t clip_y1)
{
    tof_tiny_draw_char_scaled_clipped(x, y, ch, color, TOF_DBG_SCALE, clip_x0, clip_y0, clip_x1, clip_y1);
}

static void tof_tiny_draw_char_scaled_clipped(int32_t x,
                                              int32_t y,
                                              char ch,
                                              uint16_t color,
                                              uint32_t scale,
                                              int32_t clip_x0,
                                              int32_t clip_y0,
                                              int32_t clip_x1,
                                              int32_t clip_y1)
{
    if (scale == 0u)
    {
        return;
    }

    uint8_t rows[TOF_DBG_CHAR_H];
    tof_dbg_get_glyph(ch, rows);

