telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    for (uint32_t ry = 0u; ry < TOF_DBG_CHAR_H; ry++)
    {
        for (uint32_t rx = 0u; rx < TOF_DBG_CHAR_W; rx++)
        {
            if (((rows[ry] >> (TOF_DBG_CHAR_W - 1u - rx)) & 0x1u) == 0u)
            {
                continue;
            }

            const int32_t px0 = x + (int32_t)(rx * scale);
            const int32_t py0 = y + (int32_t)(ry * scale);
            const int32_t px1 = px0 + (int32_t)scale - 1;
            const int32_t py1 = py0 + (int32_t)scale - 1;
            if (px1 < clip_x0 || px0 > clip_x1 || py1 < clip_y0 || py0 > clip_y1)
            {
                continue;
            }
            display_hal_fill_rect(px0, py0, px1, py1, color);
        }
    }
}

static void tof_dbg_draw_char(int32_t x, int32_t y, char ch, uint16_t color)
{
    tof_tiny_draw_char_clipped(x, y, ch, color, s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y1);
}

static void tof_dbg_draw_line(uint32_t line_idx, const char *text, uint16_t color)
{
    if (line_idx >= TOF_DBG_LINES)
    {
        return;
    }

    char clipped[TOF_DBG_COLS + 1u];
    size_t n = strlen(text);
    if (n > TOF_DBG_COLS)
    {
        n = TOF_DBG_COLS;
    }
    memcpy(clipped, text, n);
    clipped[n] = '\0';

    if (!s_dbg_force_redraw && strcmp(clipped, s_dbg_prev[line_idx]) == 0)
    {
        return;
    }

    strcpy(s_dbg_prev[line_idx], clipped);

    const int32_t y = s_dbg_y0 + 3 + (int32_t)(line_idx * TOF_DBG_LINE_H);
    const int32_t line_h = (TOF_DBG_CHAR_H * TOF_DBG_SCALE);
    display_hal_fill_rect(s_dbg_x0 + 2, y, s_dbg_x1 - 2, y + line_h, s_ui_dbg_bg);

    int32_t x = s_dbg_x0 + 4;
    for (size_t i = 0u; i < n; i++)
    {
        if ((x + (TOF_DBG_CHAR_W * TOF_DBG_SCALE)) > (s_dbg_x1 - 2))
        {
            break;
        }
        tof_dbg_draw_char(x, y, clipped[i], color);
        x += TOF_DBG_CHAR_ADV;
    }
}

static tof_roll_alert_level_t tof_roll_alert_level_from_model_mm(uint16_t mm, uint32_t fullness_q10)
{
    if (fullness_q10 > 1024u)
    {
        fullness_q10 = 1024u;
    }

    if (mm == 0u)
    {
        return kTofRollAlertFull;
    }

    if (mm > TOF_ROLL_EMPTY_TRIGGER_MM)
    {
        return kTofRollAlertEmpty;
    }

    if (fullness_q10 >= TOF_ROLL_FULL_MIN_Q10)
    {
        return kTofRollAlertFull;
    }

    if (fullness_q10 >= TOF_ROLL_MEDIUM_MIN_Q10)
    {
        return kTofRollAlertMedium;
    }

    return kTofRollAlertLow;
}

static void tof_roll_status_style(tof_roll_alert_level_t level,
                                  const char **label,
                                  uint16_t *bg,
                                  uint16_t *border,
                                  uint16_t *fg)
{
    const char *text = "ROLL FULL";
    uint16_t c_bg = pack_rgb565(22u, 82u, 28u);
    uint16_t c_border = pack_rgb565(118u, 210u, 126u);
    uint16_t c_fg = pack_rgb565(236u, 242u, 240u);

    switch (level)
    {
        case kTofRollAlertMedium:
            text = "ROLL MEDIUM";
            c_bg = pack_rgb565(98u, 82u, 18u);
            c_border = pack_rgb565(232u, 202u, 104u);
            c_fg = pack_rgb565(248u, 236u, 206u);
            break;
        case kTofRollAlertLow:
            text = "ROLL LOW";
            c_bg = pack_rgb565(128u, 106u, 20u);
            c_border = pack_rgb565(246u, 224u, 98u);
            c_fg = pack_rgb565(254u, 246u, 214u);
            break;
        case kTofRollAlertEmpty:
            text = "ROLL EMPTY";
            c_bg = pack_rgb565(86u, 8u, 8u);
            c_border = pack_rgb565(246u, 104u, 104u);
            c_fg = pack_rgb565(254u, 228u, 228u);
            break;
        case kTofRollAlertFull:
        default:
            break;
    }

    if (label != NULL)
    {
        *label = text;
    }
    if (bg != NULL)
    {
        *bg = c_bg;
    }
    if (border != NULL)
    {
        *border = c_border;
    }
    if (fg != NULL)
    {
        *fg = c_fg;
    }
}

static const char *tof_roll_popup_message(tof_roll_alert_level_t level)
{
    if (level == kTofRollAlertLow)
    {
        return "WARNING ROLL LOW";
    }
    if (level == kTofRollAlertEmpty)
    {
        return "WARNING ROLL EMPTY";
    }
    return "ROLL STATUS";
}

static void tof_draw_ai_pill(bool ai_on)
{
    if (!s_dbg_force_redraw && s_ai_pill_prev_valid && (s_ai_pill_prev_on == ai_on))
    {
        return;
    }

    const uint16_t bg = ai_on ? pack_rgb565(22u, 86u, 46u) : pack_rgb565(92u, 22u, 24u);
    const uint16_t border = ai_on ? pack_rgb565(120u, 210u, 140u) : pack_rgb565(220u, 120u, 120u);
    const uint16_t fg = pack_rgb565(238u, 242u, 246u);

    display_hal_fill_rect(s_ai_pill_x0, s_ai_pill_y0, s_ai_pill_x1, s_ai_pill_y1, bg);
    display_hal_fill_rect(s_ai_pill_x0, s_ai_pill_y0, s_ai_pill_x1, s_ai_pill_y0, border);
    display_hal_fill_rect(s_ai_pill_x0, s_ai_pill_y1, s_ai_pill_x1, s_ai_pill_y1, border);
    display_hal_fill_rect(s_ai_pill_x0, s_ai_pill_y0, s_ai_pill_x0, s_ai_pill_y1, border);
    display_hal_fill_rect(s_ai_pill_x1, s_ai_pill_y0, s_ai_pill_x1, s_ai_pill_y1, border);

    const char *label = ai_on ? "AI ON" : "AI OFF";
    const size_t n = strlen(label);
    const int32_t text_w = (n > 0u) ? ((int32_t)(n * TOF_DBG_CHAR_ADV) - 2) : 0;
    const int32_t text_h = TOF_DBG_CHAR_H * TOF_DBG_SCALE;
    int32_t x = s_ai_pill_x0 + ((s_ai_pill_x1 - s_ai_pill_x0 + 1 - text_w) / 2);
    int32_t y = s_ai_pill_y0 + ((s_ai_pill_y1 - s_ai_pill_y0 + 1 - text_h) / 2);
    if (x < (s_ai_pill_x0 + 2))
    {
        x = s_ai_pill_x0 + 2;
    }
    if (y < (s_ai_pill_y0 + 1))
    {
        y = s_ai_pill_y0 + 1;
    }

    for (size_t i = 0u; i < n; i++)
    {
        tof_dbg_draw_char(x, y, label[i], fg);
        x += TOF_DBG_CHAR_ADV;
    }

    s_ai_pill_prev_valid = true;
    s_ai_pill_prev_on = ai_on;
}

static void tof_draw_alert_pill(bool alert_on)
{
    if (!s_dbg_force_redraw && s_alert_pill_prev_valid && (s_alert_pill_prev_on == alert_on))
    {
        return;
    }

    const uint16_t bg = alert_on ? pack_rgb565(78u, 62u, 18u) : pack_rgb565(48u, 26u, 18u);
    const uint16_t border = alert_on ? pack_rgb565(232u, 198u, 98u) : pack_rgb565(202u, 128u, 104u);
    const uint16_t fg = pack_rgb565(246u, 238u, 218u);
    const char *label = alert_on ? "ALERT ON" : "ALERT OFF";

