telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    display_hal_fill_rect(s_alert_pill_x0, s_alert_pill_y0, s_alert_pill_x1, s_alert_pill_y1, bg);
    display_hal_fill_rect(s_alert_pill_x0, s_alert_pill_y0, s_alert_pill_x1, s_alert_pill_y0, border);
    display_hal_fill_rect(s_alert_pill_x0, s_alert_pill_y1, s_alert_pill_x1, s_alert_pill_y1, border);
    display_hal_fill_rect(s_alert_pill_x0, s_alert_pill_y0, s_alert_pill_x0, s_alert_pill_y1, border);
    display_hal_fill_rect(s_alert_pill_x1, s_alert_pill_y0, s_alert_pill_x1, s_alert_pill_y1, border);

    const size_t n = strlen(label);
    const int32_t text_w = (n > 0u) ? ((int32_t)(n * TOF_DBG_CHAR_ADV) - 2) : 0;
    const int32_t text_h = TOF_DBG_CHAR_H * TOF_DBG_SCALE;
    int32_t x = s_alert_pill_x0 + ((s_alert_pill_x1 - s_alert_pill_x0 + 1 - text_w) / 2);
    int32_t y = s_alert_pill_y0 + ((s_alert_pill_y1 - s_alert_pill_y0 + 1 - text_h) / 2);
    if (x < (s_alert_pill_x0 + 2))
    {
        x = s_alert_pill_x0 + 2;
    }
    if (y < (s_alert_pill_y0 + 1))
    {
        y = s_alert_pill_y0 + 1;
    }

    for (size_t i = 0u; i < n; i++)
    {
        tof_tiny_draw_char_clipped(x, y, label[i], fg, s_alert_pill_x0, s_alert_pill_y0, s_alert_pill_x1, s_alert_pill_y1);
        x += TOF_DBG_CHAR_ADV;
    }

    s_alert_pill_prev_valid = true;
    s_alert_pill_prev_on = alert_on;
}

static void tof_alert_popup_rect(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1)
{
    int32_t popup_w = (TOF_LCD_W * TOF_ALERT_POPUP_W_PCT) / 100;
    popup_w = tof_clamp_i32(popup_w, 160, TOF_LCD_W - (2 * TOF_ALERT_POPUP_X_MARGIN));
    int32_t lx0 = (TOF_LCD_W - popup_w) / 2;
    int32_t lx1 = lx0 + popup_w - 1;
    int32_t ly0 = (TOF_LCD_H - TOF_ALERT_POPUP_H) / 2;
    int32_t ly1 = ly0 + TOF_ALERT_POPUP_H - 1;

    lx0 = tof_clamp_i32(lx0, 0, TOF_LCD_W - 1);
    lx1 = tof_clamp_i32(lx1, 0, TOF_LCD_W - 1);
    ly0 = tof_clamp_i32(ly0, 0, TOF_LCD_H - 1);
    ly1 = tof_clamp_i32(ly1, 0, TOF_LCD_H - 1);
    if (ly1 <= ly0)
    {
        ly0 = 2;
        ly1 = ly0 + TOF_ALERT_POPUP_H - 1;
        if (ly1 >= TOF_LCD_H)
        {
            ly1 = TOF_LCD_H - 1;
            ly0 = ly1 - TOF_ALERT_POPUP_H + 1;
            ly0 = tof_clamp_i32(ly0, 0, TOF_LCD_H - 1);
        }
    }

    if (x0 != NULL)
    {
        *x0 = lx0;
    }
    if (y0 != NULL)
    {
        *y0 = ly0;
    }
    if (x1 != NULL)
    {
        *x1 = lx1;
    }
    if (y1 != NULL)
    {
        *y1 = ly1;
    }
}

static void tof_scrub_left_panel(bool force_debug_redraw)
{
    display_hal_fill_rect(TOF_Q1_X0, TOF_Q1_TOP_Y0, TOF_Q1_X1, TOF_Q1_TOP_Y1, s_ui_bg);
    display_hal_fill_rect(TOF_Q1_X0, TOF_Q1_BOT_Y0, TOF_Q1_X1, TOF_Q1_BOT_Y1, s_ui_bg);
    display_hal_fill_rect(s_dbg_x0, TOF_Q1_BOT_Y0, s_dbg_x1, TOF_Q1_BOT_Y0, pack_rgb565(28u, 32u, 36u));
    display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y1, s_ui_dbg_bg);
    display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y0, pack_rgb565(32u, 38u, 44u));

    for (uint32_t i = 0u; i < 64u; i++)
    {
        const tof_cell_rect_t *c = &s_cells[i];
        display_hal_fill_rect(c->x0, c->y0, c->x1, c->y1, s_ui_border);
        display_hal_fill_rect(c->ix0, c->iy0, c->ix1, c->iy1, s_ui_bg);
    }

    memset(s_cell_drawn, 0, sizeof(s_cell_drawn));
    memset(s_last_cell_color, 0, sizeof(s_last_cell_color));
    s_hot_idx = -1;
    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        s_curve_pick_idx[y] = -1;
        s_curve_prev_pick_idx[y] = -1;
    }

    if (force_debug_redraw)
    {
        memset(s_dbg_prev, 0, sizeof(s_dbg_prev));
        s_dbg_force_redraw = true;
        s_ai_pill_prev_valid = false;
        s_alert_pill_prev_valid = false;
    }
}

static void tof_invalidate_after_popup_overlay(void)
{
    tof_scrub_left_panel(true);
    display_hal_fill_rect(TOF_TP_X0, TOF_TP_Y0, TOF_TP_X1, TOF_TP_Y1, tof_tp_bg_color(255u, true));
    display_hal_fill_rect(TOF_Q_W, 0, TOF_Q_W, TOF_LCD_H - 1, pack_rgb565(20u, 24u, 28u));
    s_roll_status_prev_valid = false;
    s_tp_force_redraw = true;
    s_tp_prev_rect_valid = false;
}

static void tof_clear_roll_status_popup(bool live_data)
{
    (void)live_data;

    if (!s_alert_popup_prev_drawn)
    {
        return;
    }

    tof_invalidate_after_popup_overlay();
    s_alert_popup_prev_drawn = false;
}

static void tof_draw_roll_status_popup(bool live_data, tof_roll_alert_level_t level)
{
    int32_t x0 = 0;
    int32_t y0 = 0;
    int32_t x1 = 0;
    int32_t y1 = 0;
    tof_alert_popup_rect(&x0, &y0, &x1, &y1);
    if (x1 < x0 || y1 < y0)
    {
        return;
    }

    if (s_alert_popup_prev_drawn &&
        (s_alert_popup_prev_x0 != x0 || s_alert_popup_prev_y0 != y0 ||
         s_alert_popup_prev_x1 != x1 || s_alert_popup_prev_y1 != y1))
    {
        tof_clear_roll_status_popup(live_data);
    }

    const char *subtitle = (level == kTofRollAlertEmpty) ? "ROLL EMPTY" : "ROLL LOW";
    const char *fallback = tof_roll_popup_message(level);
    const bool two_line = (level == kTofRollAlertLow) || (level == kTofRollAlertEmpty);
    uint16_t bg = 0u;
    uint16_t border = 0u;
    uint16_t fg = 0u;
    tof_roll_status_style(level, NULL, &bg, &border, &fg);

    uint16_t frame_color = border;
    uint16_t panel_bg = bg;
    uint16_t title_fg = pack_rgb565(255u, 248u, 224u);
    uint16_t sub_fg = fg;
    const uint16_t shadow_fg = pack_rgb565(10u, 10u, 12u);

    if (level == kTofRollAlertEmpty)
    {
        frame_color = pack_rgb565(248u, 140u, 140u);
        panel_bg = pack_rgb565(72u, 14u, 16u);
        title_fg = pack_rgb565(255u, 234u, 224u);
        sub_fg = pack_rgb565(255u, 214u, 206u);
    }
    else if (level == kTofRollAlertLow)
    {
        frame_color = pack_rgb565(246u, 214u, 96u);
        panel_bg = pack_rgb565(92u, 76u, 20u);
        title_fg = pack_rgb565(255u, 248u, 218u);
        sub_fg = pack_rgb565(252u, 240u, 190u);
    }

    display_hal_fill_rect(x0, y0, x1, y1, frame_color);
    if ((x1 - x0) >= 2 && (y1 - y0) >= 2)
    {
        display_hal_fill_rect(x0 + 1, y0 + 1, x1 - 1, y1 - 1, panel_bg);
    }

    const int32_t ix0 = x0 + 1;
    const int32_t iy0 = y0 + 1;
    const int32_t ix1 = x1 - 1;

