telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    if (two_line)
    {
        const char *hint = (level == kTofRollAlertEmpty) ? "Replace spool To Reset" : NULL;
        const size_t hint_n = (hint != NULL) ? strlen(hint) : 0u;
        const int32_t avail_w = (ix1 - ix0 + 1) - 4;
        uint32_t title_scale = 4u;
        uint32_t sub_scale = 3u;
        uint32_t hint_scale = 2u;
        int32_t title_adv = (TOF_DBG_CHAR_W * (int32_t)title_scale) + 2;
        int32_t sub_adv = (TOF_DBG_CHAR_W * (int32_t)sub_scale) + 2;
        int32_t hint_adv = (TOF_DBG_CHAR_W * (int32_t)hint_scale) + 2;
        const size_t title_n = strlen("WARNING");
        const size_t sub_n = strlen(subtitle);
        int32_t title_w = (title_n > 0u) ? ((int32_t)(title_n * (size_t)title_adv) - 2) : 0;
        int32_t sub_w = (sub_n > 0u) ? ((int32_t)(sub_n * (size_t)sub_adv) - 2) : 0;
        int32_t hint_w = (hint_n > 0u) ? ((int32_t)(hint_n * (size_t)hint_adv) - 2) : 0;
        if (title_w > avail_w)
        {
            title_scale = 2u;
            title_adv = (TOF_DBG_CHAR_W * (int32_t)title_scale) + 2;
            title_w = (title_n > 0u) ? ((int32_t)(title_n * (size_t)title_adv) - 2) : 0;
        }
        if (sub_w > avail_w)
        {
            sub_scale = 1u;
            sub_adv = (TOF_DBG_CHAR_W * (int32_t)sub_scale) + 2;
            sub_w = (sub_n > 0u) ? ((int32_t)(sub_n * (size_t)sub_adv) - 2) : 0;
        }
        if (hint_w > avail_w)
        {
            hint_scale = 1u;
            hint_adv = (TOF_DBG_CHAR_W * (int32_t)hint_scale) + 2;
            hint_w = (hint_n > 0u) ? ((int32_t)(hint_n * (size_t)hint_adv) - 2) : 0;
            if (hint_w > avail_w)
            {
                hint_w = avail_w;
            }
        }

        const int32_t title_h = TOF_DBG_CHAR_H * (int32_t)title_scale;
        const int32_t sub_h = TOF_DBG_CHAR_H * (int32_t)sub_scale;
        const int32_t hint_h = (hint_n > 0u) ? (TOF_DBG_CHAR_H * (int32_t)hint_scale) : 0;
        const int32_t gap = 5;
        const int32_t hint_gap = (hint_n > 0u) ? 3 : 0;
        const int32_t total_h = title_h + gap + sub_h + hint_gap + hint_h;
        int32_t ty0 = y0 + ((y1 - y0 + 1 - total_h) / 2);
        if (ty0 < (iy0 + 1))
        {
            ty0 = iy0 + 1;
        }
        int32_t tx0 = x0 + ((x1 - x0 + 1 - title_w) / 2);
        if (tx0 < (ix0 + 1))
        {
            tx0 = ix0 + 1;
        }
        for (size_t i = 0u; i < title_n; i++)
        {
            tof_tiny_draw_char_scaled_clipped(tx0 + 1,
                                              ty0 + 1,
                                              "WARNING"[i],
                                              shadow_fg,
                                              title_scale,
                                              x0,
                                              y0,
                                              x1,
                                              y1);
            tof_tiny_draw_char_scaled_clipped(tx0,
                                              ty0,
                                              "WARNING"[i],
                                              title_fg,
                                              title_scale,
                                              x0,
                                              y0,
                                              x1,
                                              y1);
            tx0 += title_adv;
        }

        int32_t sy = ty0 + title_h + gap;
        if (sy < (iy0 + 1))
        {
            sy = iy0 + 1;
        }
        int32_t sx = x0 + ((x1 - x0 + 1 - sub_w) / 2);
        if (sx < (ix0 + 1))
        {
            sx = ix0 + 1;
        }
        for (size_t i = 0u; i < sub_n; i++)
        {
            tof_tiny_draw_char_scaled_clipped(sx + 1, sy + 1, subtitle[i], shadow_fg, sub_scale, x0, y0, x1, y1);
            tof_tiny_draw_char_scaled_clipped(sx, sy, subtitle[i], sub_fg, sub_scale, x0, y0, x1, y1);
            sx += sub_adv;
        }

        if (hint_n > 0u)
        {
            int32_t hy = sy + sub_h + hint_gap;
            if (hy < (iy0 + 1))
            {
                hy = iy0 + 1;
            }
            int32_t hx = x0 + ((x1 - x0 + 1 - hint_w) / 2);
            if (hx < (ix0 + 1))
            {
                hx = ix0 + 1;
            }
            const uint16_t hint_fg = pack_rgb565(255u, 206u, 206u);
            int32_t max_w = ix1 - hx + 1;
            int32_t draw_chars = max_w / hint_adv;
            if (draw_chars < 0)
            {
                draw_chars = 0;
            }
            if ((size_t)draw_chars > hint_n)
            {
                draw_chars = (int32_t)hint_n;
            }
            for (int32_t i = 0; i < draw_chars; i++)
            {
                tof_tiny_draw_char_scaled_clipped(hx + 1,
                                                  hy + 1,
                                                  hint[(size_t)i],
                                                  shadow_fg,
                                                  hint_scale,
                                                  x0,
                                                  y0,
                                                  x1,
                                                  y1);
                tof_tiny_draw_char_scaled_clipped(hx,
                                                  hy,
                                                  hint[(size_t)i],
                                                  hint_fg,
                                                  hint_scale,
                                                  x0,
                                                  y0,
                                                  x1,
                                                  y1);
                hx += hint_adv;
            }
        }
    }
    else
    {
        const size_t n = strlen(fallback);
        const int32_t text_w = (n > 0u) ? ((int32_t)(n * TOF_DBG_CHAR_ADV) - 2) : 0;
        const int32_t text_h = TOF_DBG_CHAR_H * TOF_DBG_SCALE;
        int32_t tx = x0 + ((x1 - x0 + 1 - text_w) / 2);
        int32_t ty = y0 + ((y1 - y0 + 1 - text_h) / 2);
        if (tx < (ix0 + 1))
        {
            tx = ix0 + 1;
        }
        if (ty < (iy0 + 1))
        {
            ty = iy0 + 1;
        }

        for (size_t i = 0u; i < n; i++)
        {
            tof_tiny_draw_char_clipped(tx + 1, ty + 1, fallback[i], shadow_fg, x0, y0, x1, y1);
            tof_tiny_draw_char_clipped(tx, ty, fallback[i], sub_fg, x0, y0, x1, y1);
            tx += TOF_DBG_CHAR_ADV;
        }
    }

    s_alert_popup_prev_drawn = true;
    s_alert_popup_prev_level = level;
    s_alert_popup_last_live = live_data;
    s_alert_popup_prev_x0 = (int16_t)x0;
    s_alert_popup_prev_y0 = (int16_t)y0;
    s_alert_popup_prev_x1 = (int16_t)x1;
    s_alert_popup_prev_y1 = (int16_t)y1;
}

static void tof_update_roll_alert_ui(uint32_t fullness_q10, bool live_data, uint32_t tick)
{
    if (fullness_q10 > 1024u)
    {
        fullness_q10 = 1024u;
    }

    uint16_t level_mm = s_roll_model_mm;
    if (level_mm == 0u)
    {
        level_mm = s_tp_live_actual_mm;
    }
    tof_roll_alert_level_t level = tof_roll_alert_level_from_model_mm(level_mm, fullness_q10);

    const bool warning_level = (level == kTofRollAlertLow) || (level == kTofRollAlertEmpty);
    const bool hard_empty_popup = (level == kTofRollAlertEmpty);
    tof_draw_alert_pill(s_alert_runtime_on);
    tof_draw_roll_status_banner(level, live_data);

