telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    const bool level_changed = (!s_roll_alert_prev_valid || (s_roll_alert_prev_level != level));
    if (level_changed)
    {
        s_roll_alert_prev_level = level;
        s_roll_alert_prev_valid = true;
    }

    const bool live_full_sample = (((s_tp_live_actual_mm > 0u) &&
                                    (s_tp_live_actual_mm <= TOF_ROLL_FULL_CAPTURE_MM)) ||
                                   ((s_tp_live_closest_mm > 0u) &&
                                    (s_tp_live_closest_mm <= TOF_ROLL_FULL_CAPTURE_MM)) ||
                                   ((s_roll_model_mm > 0u) &&
                                    (s_roll_model_mm <= TOF_ROLL_FULL_CAPTURE_MM)));
    if (live_full_sample)
    {
        if (s_roll_full_rearm_streak < 255u)
        {
            s_roll_full_rearm_streak++;
        }
    }
    else
    {
        s_roll_full_rearm_streak = 0u;
    }

    const bool live_full_reset = (s_roll_full_rearm_streak >= TOF_ROLL_FULL_REARM_STREAK);
    const bool level_full_valid = (level_mm > 0u) &&
                                  (level_mm <= TOF_ROLL_MEDIUM_TRIGGER_MM);
    const bool forced_full_capture = s_alert_popup_hold_empty &&
                                     (s_tp_live_closest_mm > 0u) &&
                                     (s_tp_live_closest_mm <= TOF_ROLL_FULL_CAPTURE_MM);
    const bool full_reset = live_full_reset || level_full_valid || forced_full_capture;
    if (full_reset)
    {
        s_roll_full_rearm_streak = 0u;
        s_alert_low_popup_shown = false;
        s_alert_popup_hold_empty = false;
        s_alert_popup_rearm_on_full = true;
        s_alert_popup_active = false;
    }

    if (!s_alert_runtime_on)
    {
        s_alert_popup_active = false;
        s_alert_popup_hold_empty = false;
        if (s_alert_popup_prev_drawn || s_dbg_force_redraw)
        {
            tof_clear_roll_status_popup(live_data);
        }
        return;
    }

    if (s_alert_popup_hold_empty)
    {
        s_alert_popup_active = true;
        s_alert_popup_level = kTofRollAlertEmpty;
    }
    else if (hard_empty_popup)
    {
        s_alert_popup_active = true;
        s_alert_popup_level = kTofRollAlertEmpty;
        s_alert_popup_until_tick = 0u;
        s_alert_popup_prev_drawn = false;
        s_alert_popup_hold_empty = true;
        s_alert_popup_rearm_on_full = false;
    }
    else if (level_changed &&
             warning_level &&
             s_alert_popup_rearm_on_full &&
             ((level != kTofRollAlertLow) || !s_alert_low_popup_shown))
    {
        s_alert_popup_active = true;
        s_alert_popup_level = (level == kTofRollAlertEmpty) ? kTofRollAlertLow : level;
        s_alert_popup_until_tick = tick + TOF_ALERT_POPUP_TICKS;
        s_alert_popup_prev_drawn = false;
        s_alert_popup_rearm_on_full = false;
        if (level == kTofRollAlertLow)
        {
            s_alert_low_popup_shown = true;
        }
    }

    if (s_alert_popup_active &&
        !s_alert_popup_hold_empty &&
        ((int32_t)(tick - s_alert_popup_until_tick) >= 0))
    {
        s_alert_popup_active = false;
    }

    if (s_alert_popup_active)
    {
        if (!s_alert_popup_prev_drawn ||
            s_dbg_force_redraw ||
            (s_alert_popup_prev_level != s_alert_popup_level))
        {
            tof_draw_roll_status_popup(live_data, s_alert_popup_level);
        }
    }
    else if (s_alert_popup_prev_drawn)
    {
        tof_clear_roll_status_popup(live_data);
    }
}

static void tof_touch_delay_ms(uint32_t delay_ms)
{
    SDK_DelayAtLeastUs(delay_ms * 1000u, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
}

static status_t tof_touch_i2c_send(uint8_t deviceAddress,
                                   uint32_t subAddress,
                                   uint8_t subaddressSize,
                                   const uint8_t *txBuff,
                                   uint8_t txBuffSize)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = subAddress;
    xfer.subaddressSize = subaddressSize;
    xfer.data = (uint8_t *)(uintptr_t)txBuff;
    xfer.dataSize = txBuffSize;
    return LPI2C_MasterTransferBlocking(TOF_TOUCH_I2C, &xfer);
}

static status_t tof_touch_i2c_receive(uint8_t deviceAddress,
                                      uint32_t subAddress,
                                      uint8_t subaddressSize,
                                      uint8_t *rxBuff,
                                      uint8_t rxBuffSize)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = subAddress;
    xfer.subaddressSize = subaddressSize;
    xfer.data = rxBuff;
    xfer.dataSize = rxBuffSize;
    return LPI2C_MasterTransferBlocking(TOF_TOUCH_I2C, &xfer);
}

static void tof_touch_config_int_pin(gt911_int_pin_mode_t mode)
{
    CLOCK_EnableClock(kCLOCK_Port4);

    port_pin_config_t cfg = {
        .pullSelect = kPORT_PullDown,
        .pullValueSelect = kPORT_LowPullResistor,
        .slewRate = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable = kPORT_OpenDrainDisable,
        .driveStrength = kPORT_LowDriveStrength,
#if defined(FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH1) && FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH1
        .driveStrength1 = kPORT_NormalDriveStrength,
#endif
        .mux = kPORT_MuxAlt0,
        .inputBuffer = kPORT_InputBufferEnable,
        .invertInput = kPORT_InputNormal,
        .lockRegister = kPORT_UnlockRegister,
    };

    switch (mode)
    {
        case kGT911_IntPinPullUp:
            cfg.pullSelect = kPORT_PullUp;
            break;
        case kGT911_IntPinPullDown:
            cfg.pullSelect = kPORT_PullDown;
            break;
        case kGT911_IntPinInput:
            cfg.pullSelect = kPORT_PullDisable;
            break;
        default:
            break;
    }

    PORT_SetPinConfig(TOF_TOUCH_INT_PORT, TOF_TOUCH_INT_PIN, &cfg);
}

static void tof_touch_config_reset_pin(bool pullUp)
{
    (void)pullUp;
}

static void tof_touch_init(void)
{
    s_touch_ready = false;
    s_touch_was_down = false;
    s_touch_last_poll_tick = 0u;

    gt911_config_t cfg = {
        .I2C_SendFunc = tof_touch_i2c_send,
        .I2C_ReceiveFunc = tof_touch_i2c_receive,
        .timeDelayMsFunc = tof_touch_delay_ms,
        .intPinFunc = tof_touch_config_int_pin,
        .pullResetPinFunc = tof_touch_config_reset_pin,
        .touchPointNum = TOF_TOUCH_POINTS,
        .i2cAddrMode = kGT911_I2cAddrAny,
        .intTrigMode = kGT911_IntFallingEdge,
    };

    const status_t st = GT911_Init(&s_touch_handle, &cfg);
    if (st == kStatus_Success)
    {
        s_touch_ready = true;
        PRINTF("TOF touch: GT911 ready (%u x %u)\r\n",
               (unsigned)s_touch_handle.resolutionX,
               (unsigned)s_touch_handle.resolutionY);
    }
    else
    {
        PRINTF("TOF touch: GT911 init failed: %d\r\n", (int)st);
    }
}

static bool tof_touch_get_point(int32_t *x_out, int32_t *y_out)
{
    if (!s_touch_ready || x_out == NULL || y_out == NULL)
    {
        return false;
    }

