telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    touch_point_t points[TOF_TOUCH_POINTS];
    uint8_t point_count = TOF_TOUCH_POINTS;
    const status_t st = GT911_GetMultiTouch(&s_touch_handle, &point_count, points);
    if (st != kStatus_Success)
    {
        return false;
    }

    const touch_point_t *selected = NULL;
    for (uint8_t i = 0u; i < point_count; i++)
    {
        if (points[i].valid && points[i].touchID == 0u)
        {
            selected = &points[i];
            break;
        }
    }
    if (selected == NULL)
    {
        for (uint8_t i = 0u; i < point_count; i++)
        {
            if (points[i].valid)
            {
                selected = &points[i];
                break;
            }
        }
    }
    if (selected == NULL)
    {
        return false;
    }

    const int32_t res_x = (s_touch_handle.resolutionX > 0u) ? (int32_t)s_touch_handle.resolutionX : TOF_LCD_W;
    int32_t x = (int32_t)selected->y;
    int32_t y = res_x - (int32_t)selected->x;
    x = tof_clamp_i32(x, 0, TOF_LCD_W - 1);
    y = tof_clamp_i32(y, 0, TOF_LCD_H - 1);

    *x_out = x;
    *y_out = y;
    return true;
}

static void tof_touch_poll_ai_toggle(uint32_t tick)
{
    if (!s_touch_ready)
    {
        return;
    }

    if ((uint32_t)(tick - s_touch_last_poll_tick) < TOF_TOUCH_POLL_TICKS)
    {
        return;
    }
    s_touch_last_poll_tick = tick;

    int32_t tx = 0;
    int32_t ty = 0;
    const bool pressed = tof_touch_get_point(&tx, &ty);
    const bool in_ai_pill = pressed &&
                            tx >= s_ai_pill_x0 && tx <= s_ai_pill_x1 &&
                            ty >= s_ai_pill_y0 && ty <= s_ai_pill_y1;
    const bool in_alert_pill = pressed &&
                               tx >= s_alert_pill_x0 && tx <= s_alert_pill_x1 &&
                               ty >= s_alert_pill_y0 && ty <= s_alert_pill_y1;

    if (in_ai_pill && !s_touch_was_down)
    {
        s_ai_runtime_on = !s_ai_runtime_on;
        tof_ai_grid_reset();
        s_dbg_force_redraw = true;
        s_tp_force_redraw = true;
        s_ai_pill_prev_valid = false;
        s_alert_pill_prev_valid = false;
        PRINTF("TOF AI: %s\r\n", s_ai_runtime_on ? "ON" : "OFF");
    }
    else if (in_alert_pill && !s_touch_was_down)
    {
        s_alert_runtime_on = !s_alert_runtime_on;
        s_dbg_force_redraw = true;
        s_alert_pill_prev_valid = false;
        s_roll_alert_prev_valid = false;
        if (!s_alert_runtime_on)
        {
            s_alert_popup_active = false;
            s_alert_popup_hold_empty = false;
            s_roll_full_rearm_streak = 0u;
        }
        PRINTF("TOF ALERT: %s\r\n", s_alert_runtime_on ? "ON" : "OFF");
    }

    s_touch_was_down = pressed;
}

static void tof_calc_frame_stats(const uint16_t mm[64],
                                 uint32_t *valid_count,
                                 uint16_t *min_mm,
                                 uint16_t *max_mm,
                                 uint16_t *avg_mm)
{
    uint32_t valid = 0u;
    uint32_t sum = 0u;
    uint16_t min_v = 0xFFFFu;
    uint16_t max_v = 0u;

    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (!tof_mm_valid(v))
        {
            continue;
        }
        valid++;
        sum += v;
        if (v < min_v)
        {
            min_v = v;
        }
        if (v > max_v)
        {
            max_v = v;
        }
    }

    if (valid_count) *valid_count = valid;
    if (min_mm) *min_mm = (valid > 0u) ? min_v : 0u;
    if (max_mm) *max_mm = (valid > 0u) ? max_v : 0u;
    if (avg_mm) *avg_mm = (valid > 0u) ? (uint16_t)(sum / valid) : 0u;
}

static const uint16_t *tof_calc_metric_frame(const uint16_t mm[64], bool live_data)
{
    if (!live_data || !s_ai_runtime_on)
    {
        return mm;
    }

    static uint16_t metric_mm[64];
    uint16_t repaired_mm[64];
    tof_ai_denoise_heatmap_frame(mm, metric_mm, live_data);
    tof_fill_display_holes(metric_mm, repaired_mm);
    memcpy(metric_mm, repaired_mm, sizeof(repaired_mm));
    tof_repair_corner_blindspots(metric_mm);

    uint32_t filtered_valid = 0u;
    tof_calc_frame_stats(metric_mm, &filtered_valid, NULL, NULL, NULL);
    if (filtered_valid >= TOF_EST_VALID_MIN)
    {
        return metric_mm;
    }

    return mm;
}

static uint16_t tof_calc_actual_distance_mm(const uint16_t mm[64])
{
    uint16_t closest_in_range = 0xFFFFu;
    uint16_t closest_any = 0xFFFFu;

    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (!tof_mm_valid(v))
        {
            continue;
        }

        if (v < closest_any)
        {
            closest_any = v;
        }

        if (v >= s_range_near_mm && v <= s_range_far_mm && v < closest_in_range)
        {
            closest_in_range = v;
        }
    }

    if (closest_in_range != 0xFFFFu)
    {
        return closest_in_range;
    }

    if (closest_any != 0xFFFFu)
    {
        return closest_any;
    }

    return 0u;
}

static uint16_t tof_calc_closest_valid_mm(const uint16_t mm[64])
{
    uint16_t closest = 0xFFFFu;
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (!tof_mm_valid(v))
        {
            continue;
        }
        if (v < closest)
        {
            closest = v;
        }
    }

    return (closest == 0xFFFFu) ? 0u : closest;
}

static uint16_t tof_apply_tp_mm_shift(uint16_t mm)
{
    if (mm == 0u)
    {
        return 0u;
    }

    int32_t shifted = (int32_t)mm + TOF_TP_MM_SHIFT;
    if (shifted < (int32_t)TOF_TP_MM_CLIP_MIN)
    {
        shifted = (int32_t)TOF_TP_MM_CLIP_MIN;
    }
    if (shifted > (int32_t)TOF_TP_MM_CLIP_MAX)
    {
        shifted = (int32_t)TOF_TP_MM_CLIP_MAX;
    }
    return (uint16_t)shifted;
}

static uint16_t tof_apply_tp_mm_gain(uint16_t mm)
{
    if (mm == 0u)
    {
        return 0u;
    }

    if (mm <= TOF_TP_MM_FULL_NEAR)
    {
        return mm;
    }

    const uint32_t delta = (uint32_t)(mm - TOF_TP_MM_FULL_NEAR);
    uint32_t scaled = ((delta * TOF_TP_MM_GAIN_Q8) + 128u) >> 8;
    uint32_t gained = (uint32_t)TOF_TP_MM_FULL_NEAR + scaled;
    if (gained > TOF_TP_MM_CLIP_MAX)
    {
        gained = TOF_TP_MM_CLIP_MAX;
    }
    return (uint16_t)gained;
}

