telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
static uint16_t tof_apply_tp_mm_calibration(uint16_t mm)
{
    return tof_apply_tp_mm_gain(tof_apply_tp_mm_shift(mm));
}

static uint16_t tof_calc_roll_curve_distance_mm(const uint16_t mm[64], int16_t row_pick_idx_out[TOF_GRID_H])
{
    uint16_t row_near_mm[TOF_GRID_H];
    uint32_t row_count = 0u;

    if (row_pick_idx_out != NULL)
    {
        for (uint32_t y = 0u; y < TOF_GRID_H; y++)
        {
            row_pick_idx_out[y] = -1;
        }
    }

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        uint16_t low0 = 0xFFFFu;
        uint16_t low1 = 0xFFFFu;
        int32_t low0_idx = -1;
        uint32_t valid = 0u;
        const uint32_t row_base = y * TOF_GRID_W;
        uint32_t x_start = TOF_TP_CURVE_EDGE_GUARD_COLS;
        uint32_t x_end = TOF_GRID_W - TOF_TP_CURVE_EDGE_GUARD_COLS;
        if (x_start >= x_end)
        {
            x_start = 0u;
            x_end = TOF_GRID_W;
        }

        for (uint32_t x = x_start; x < x_end; x++)
        {
            const uint16_t v = mm[row_base + x];
            if (!tof_mm_valid(v))
            {
                continue;
            }

            valid++;
            if (v < low0)
            {
                low1 = low0;
                low0 = v;
                low0_idx = (int32_t)(row_base + x);
            }
            else if (v < low1)
            {
                low1 = v;
            }
        }

        if (valid == 0u || low0 == 0xFFFFu)
        {
            continue;
        }
        if (row_pick_idx_out != NULL)
        {
            row_pick_idx_out[y] = (int16_t)low0_idx;
        }

        uint16_t row_mm = low0;
        if (valid >= 3u && low1 != 0xFFFFu)
        {
            /* Use second-nearest sample per row to reduce single-pixel near outliers. */
            row_mm = low1;
        }
        else if (valid >= 2u && low1 != 0xFFFFu)
        {
            row_mm = (uint16_t)(((uint32_t)low0 + (uint32_t)low1 + 1u) / 2u);
        }
        row_near_mm[row_count++] = row_mm;
    }

    if (row_count < TOF_TP_CURVE_MIN_ROWS)
    {
        return 0u;
    }

    for (uint32_t i = 1u; i < row_count; i++)
    {
        const uint16_t key = row_near_mm[i];
        uint32_t j = i;
        while (j > 0u && row_near_mm[j - 1u] > key)
        {
            row_near_mm[j] = row_near_mm[j - 1u];
            j--;
        }
        row_near_mm[j] = key;
    }

    if ((row_count & 1u) == 0u)
    {
        const uint16_t a = row_near_mm[(row_count / 2u) - 1u];
        const uint16_t b = row_near_mm[row_count / 2u];
        return (uint16_t)(((uint32_t)a + (uint32_t)b + 1u) / 2u);
    }
    return row_near_mm[row_count / 2u];
}

static uint16_t tof_abs_diff_u16(uint16_t a, uint16_t b)
{
    return (a > b) ? (uint16_t)(a - b) : (uint16_t)(b - a);
}

static uint32_t tof_abs_diff_u32(uint32_t a, uint32_t b)
{
    return (a > b) ? (a - b) : (b - a);
}

static uint32_t tof_tp_fullness_q10_from_mm_q8_bounds(uint32_t mm_q8, uint16_t near_mm, uint16_t far_mm)
{
    if (mm_q8 == 0u)
    {
        return 640u;
    }

    if (far_mm <= near_mm)
    {
        far_mm = (uint16_t)(near_mm + 1u);
    }

    const uint32_t near_q8 = ((uint32_t)near_mm << 8);
    const uint32_t far_q8 = ((uint32_t)far_mm << 8);

    if (mm_q8 <= near_q8)
    {
        return 1024u;
    }

    if (mm_q8 >= far_q8)
    {
        return 0u;
    }

    return ((far_q8 - mm_q8) * 1024u) / (far_q8 - near_q8);
}

static bool tof_estimator_measure_mm_q8(const uint16_t mm[64],
                                        uint32_t *mm_q8_out,
                                        uint32_t *valid_out,
                                        uint16_t *spread_out)
{
    uint16_t values[64];
    uint32_t count = 0u;
    uint32_t center_sum = 0u;
    uint32_t center_count = 0u;
    uint16_t min_mm = 0xFFFFu;
    uint16_t max_mm = 0u;

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint16_t v = mm[(y * TOF_GRID_W) + x];
            if (!tof_mm_valid(v))
            {
                continue;
            }

            values[count++] = v;
            if (v < min_mm)
            {
                min_mm = v;
            }
            if (v > max_mm)
            {
                max_mm = v;
            }
            if ((x >= 2u && x <= 5u) && (y >= 2u && y <= 5u))
            {
                center_sum += v;
                center_count++;
            }
        }
    }

    if (valid_out)
    {
        *valid_out = count;
    }
    if (spread_out)
    {
        *spread_out = (count > 0u) ? (uint16_t)(max_mm - min_mm) : 0u;
    }

    if (count < TOF_EST_VALID_MIN)
    {
        return false;
    }

    for (uint32_t i = 1u; i < count; i++)
    {
        uint16_t key = values[i];
        int32_t j = (int32_t)i - 1;
        while (j >= 0 && values[(uint32_t)j] > key)
        {
            values[(uint32_t)j + 1u] = values[(uint32_t)j];
            j--;
        }
        values[(uint32_t)j + 1u] = key;
    }

    uint32_t trim = count / 8u;
    if ((trim * 2u) >= count)
    {
        trim = 0u;
    }

    uint32_t sum = 0u;
    uint32_t keep = 0u;
    for (uint32_t i = trim; i < (count - trim); i++)
    {
        sum += values[i];
        keep++;
    }
    if (keep == 0u)
    {
        return false;
    }

    uint32_t mean_mm = (sum + (keep / 2u)) / keep;
    if (center_count >= 4u)
    {
        const uint32_t center_mm = (center_sum + (center_count / 2u)) / center_count;
        mean_mm = (((mean_mm * 3u) + (center_mm * 2u)) + 2u) / 5u;
    }

    if (mm_q8_out)
    {
        *mm_q8_out = (mean_mm << 8);
    }
    return true;
}

static uint16_t tof_estimator_confidence_q10(uint32_t valid_count, uint16_t spread_mm, bool live_data)
{
    uint32_t valid_q10 = 0u;
    uint32_t spread_q10 = 0u;

    if (valid_count > TOF_EST_VALID_MIN)
    {
        valid_q10 = ((valid_count - TOF_EST_VALID_MIN) * 1024u) / (64u - TOF_EST_VALID_MIN);
        if (valid_q10 > 1024u)
        {
            valid_q10 = 1024u;
        }
    }

    if (spread_mm <= TOF_EST_SPREAD_GOOD_MM)
    {
        spread_q10 = 1024u;
    }
    else if (spread_mm >= TOF_EST_SPREAD_BAD_MM)
    {
        spread_q10 = 0u;
    }
    else
    {
        spread_q10 =
            (((uint32_t)(TOF_EST_SPREAD_BAD_MM - spread_mm)) * 1024u) /
            ((uint32_t)(TOF_EST_SPREAD_BAD_MM - TOF_EST_SPREAD_GOOD_MM));
    }

    uint32_t conf = (valid_q10 + spread_q10) / 2u;
    if (!live_data)
    {
        conf = (conf * 3u) / 4u;
    }
    if (conf > 1024u)
    {
        conf = 1024u;
    }
    return (uint16_t)conf;
}

static void tof_estimator_update(const uint16_t mm[64], bool live_data)
{
#if TOF_EST_ENABLE
    uint32_t measured_mm_q8 = 0u;
    uint32_t valid_count = 0u;
    uint16_t spread_mm = 0u;
    const bool have_meas = tof_estimator_measure_mm_q8(mm, &measured_mm_q8, &valid_count, &spread_mm);

