telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    if (have_meas)
    {
        const uint16_t conf_q10 = tof_estimator_confidence_q10(valid_count, spread_mm, live_data);
        s_est_valid_count = valid_count;
        s_est_spread_mm = spread_mm;
        s_est_conf_q10 = conf_q10;

        if (s_est_mm_q8 == 0u)
        {
            s_est_mm_q8 = measured_mm_q8;
        }
        else
        {
            const uint32_t delta_q8 = tof_abs_diff_u32(s_est_mm_q8, measured_mm_q8);
            uint32_t den = 8u;
            if ((delta_q8 >= ((uint32_t)TOF_EST_FAST_DELTA_MM << 8)) && (conf_q10 >= 512u))
            {
                den = 2u;
            }
            else if (conf_q10 >= 512u)
            {
                den = 4u;
            }
            else if (conf_q10 >= 256u)
            {
                den = 6u;
            }

            s_est_mm_q8 = ((s_est_mm_q8 * (den - 1u)) + measured_mm_q8 + (den / 2u)) / den;
        }

        uint16_t est_mm = (uint16_t)(s_est_mm_q8 >> 8);
        if (conf_q10 >= TOF_EST_CONF_TRAIN_MIN_Q10)
        {
            if (est_mm <= (uint16_t)(s_est_near_mm + 20u))
            {
                s_est_near_mm = (uint16_t)((((uint32_t)s_est_near_mm * 31u) + est_mm + 16u) / 32u);
            }
            if (est_mm >= (uint16_t)(s_est_far_mm - 20u))
            {
                s_est_far_mm = (uint16_t)((((uint32_t)s_est_far_mm * 31u) + est_mm + 16u) / 32u);
            }
        }

        if (s_est_near_mm < TOF_EST_NEAR_MIN_MM)
        {
            s_est_near_mm = TOF_EST_NEAR_MIN_MM;
        }
        if (s_est_near_mm > TOF_EST_NEAR_MAX_MM)
        {
            s_est_near_mm = TOF_EST_NEAR_MAX_MM;
        }
        if (s_est_far_mm < TOF_EST_FAR_MIN_MM)
        {
            s_est_far_mm = TOF_EST_FAR_MIN_MM;
        }
        if (s_est_far_mm > TOF_EST_FAR_MAX_MM)
        {
            s_est_far_mm = TOF_EST_FAR_MAX_MM;
        }
        if (s_est_far_mm < (uint16_t)(s_est_near_mm + TOF_EST_MIN_GAP_MM))
        {
            s_est_far_mm = (uint16_t)(s_est_near_mm + TOF_EST_MIN_GAP_MM);
            if (s_est_far_mm > TOF_EST_FAR_MAX_MM)
            {
                s_est_far_mm = TOF_EST_FAR_MAX_MM;
                if (s_est_far_mm > TOF_EST_MIN_GAP_MM)
                {
                    s_est_near_mm = (uint16_t)(s_est_far_mm - TOF_EST_MIN_GAP_MM);
                }
            }
        }
        const uint32_t target_fullness_q10 =
            tof_tp_fullness_q10_from_mm_q8_bounds(s_est_mm_q8, s_est_near_mm, s_est_far_mm);
        const uint32_t fullness_delta = tof_abs_diff_u32(s_est_fullness_q10, target_fullness_q10);
        uint32_t den = 8u;
        if ((conf_q10 >= 700u) && (fullness_delta >= 96u))
        {
            den = 2u;
        }
        else if (conf_q10 >= 450u)
        {
            den = 4u;
        }
        s_est_fullness_q10 =
            (uint16_t)(((uint32_t)s_est_fullness_q10 * (den - 1u) + target_fullness_q10 + (den / 2u)) / den);
    }
    else
    {
        s_est_valid_count = 0u;
        s_est_spread_mm = 0u;
        s_est_conf_q10 = (uint16_t)(((uint32_t)s_est_conf_q10 * 15u) / 16u);
    }
#else
    (void)mm;
    (void)live_data;
#endif
}

static TOF_UNUSED void tof_ai_region_means(const uint16_t mm[64], uint16_t *center_avg, uint16_t *edge_avg)
{
    uint32_t center_sum = 0u;
    uint32_t center_count = 0u;
    uint32_t edge_sum = 0u;
    uint32_t edge_count = 0u;

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint16_t v = mm[(y * TOF_GRID_W) + x];
            if (!tof_mm_valid(v))
            {
                continue;
            }

            if ((x >= 2u && x <= 5u) && (y >= 2u && y <= 5u))
            {
                center_sum += v;
                center_count++;
            }

            if (x == 0u || x == (TOF_GRID_W - 1u) || y == 0u || y == (TOF_GRID_H - 1u))
            {
                edge_sum += v;
                edge_count++;
            }
        }
    }

    if (center_avg)
    {
        *center_avg = (center_count > 0u) ? (uint16_t)(center_sum / center_count) : 0u;
    }
    if (edge_avg)
    {
        *edge_avg = (edge_count > 0u) ? (uint16_t)(edge_sum / edge_count) : 0u;
    }
}

static void tof_ai_log_frame(const uint16_t mm[64], bool live_data, uint32_t tick, uint32_t fullness_q10)
{
#if TOF_AI_DATA_LOG_ENABLE
    if (!s_ai_runtime_on)
    {
        return;
    }

    if (!live_data)
    {
        return;
    }

    if ((uint32_t)(tick - s_ai_log_last_tick) < TOF_AI_DATA_LOG_INTERVAL_TICKS)
    {
        return;
    }
    s_ai_log_last_tick = tick;

    uint32_t valid = 0u;
    uint16_t min_mm = 0u;
    uint16_t max_mm = 0u;
    uint16_t avg_mm = 0u;
    uint16_t center_avg = 0u;
    uint16_t edge_avg = 0u;
    const uint16_t actual_mm = tof_calc_actual_distance_mm(mm);

    tof_calc_frame_stats(mm, &valid, &min_mm, &max_mm, &avg_mm);
    tof_ai_region_means(mm, &center_avg, &edge_avg);

    PRINTF("AI_CSV,t=%u,live=%u,valid=%u,min=%u,max=%u,avg=%u,act=%u,center=%u,edge=%u,full_q10=%u\r\n",
           (unsigned)tick,
           1u,
           (unsigned)valid,
           (unsigned)min_mm,
           (unsigned)max_mm,
           (unsigned)avg_mm,
           (unsigned)actual_mm,
           (unsigned)center_avg,
           (unsigned)edge_avg,
           (unsigned)fullness_q10);

#if TOF_AI_DATA_LOG_FULL_FRAME
    PRINTF("AI_F64,t=%u", (unsigned)tick);
    for (uint32_t i = 0u; i < 64u; i++)
    {
        PRINTF(",%u", (unsigned)mm[i]);
    }
    PRINTF("\r\n");
#endif
#else
    (void)mm;
    (void)live_data;
    (void)tick;
    (void)fullness_q10;
#endif
}

static uint32_t tof_isqrt_u32(uint32_t n)
{
    uint32_t op = n;
    uint32_t res = 0u;
    uint32_t one = (uint32_t)1u << 30;

    while (one > op)
    {
        one >>= 2;
    }

    while (one != 0u)
    {
        if (op >= (res + one))
        {
            op -= (res + one);
            res = (res >> 1) + one;
        }
        else
        {
            res >>= 1;
        }
        one >>= 2;
    }

    return res;
}

static int32_t tof_ellipse_half_width(int32_t rx, int32_t ry, int32_t y_abs)
{
    if (rx <= 0 || ry <= 0 || y_abs >= ry)
    {
        return 0;
    }

    const uint32_t ry_u = (uint32_t)ry;
    const uint32_t y_u = (uint32_t)y_abs;
    const uint32_t term = (ry_u * ry_u) - (y_u * y_u);
    const uint32_t root = tof_isqrt_u32(term);
    return (int32_t)(((uint64_t)(uint32_t)rx * (uint64_t)root) / (uint64_t)ry_u);
}

static void tof_draw_filled_ellipse(int32_t cx, int32_t cy, int32_t rx, int32_t ry, uint16_t color)
{
    if (rx <= 0 || ry <= 0)
    {
        return;
    }

    for (int32_t y = -ry; y <= ry; y++)
    {
        const int32_t y_abs = (y < 0) ? -y : y;
        const int32_t xw = tof_ellipse_half_width(rx, ry, y_abs);
        const int32_t py = cy + y;
        if (py < TOF_TP_Y0 || py > TOF_TP_Y1)
        {
            continue;
        }

        int32_t x0 = cx - xw;
        int32_t x1 = cx + xw;
        x0 = tof_clamp_i32(x0, TOF_TP_X0, TOF_TP_X1);
        x1 = tof_clamp_i32(x1, TOF_TP_X0, TOF_TP_X1);
        if (x1 >= x0)
        {
            display_hal_fill_rect(x0, py, x1, py, color);
        }
    }
}

static uint32_t TOF_UNUSED tof_tp_fullness_q10_from_mm_q8(uint32_t mm_q8)
{
    return tof_tp_fullness_q10_from_mm_q8_bounds(mm_q8, TOF_TP_MM_FULL_NEAR, TOF_TP_MM_EMPTY_FAR);
}

static uint16_t tof_tp_bg_color(uint32_t t, bool live_data)
{
    (void)t;
    (void)live_data;
    uint32_t r = 8u;
    uint32_t g = 28u;
    uint32_t b = 64u;
    return pack_rgb565(r, g, b);
}

