telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
static void tof_tp_fill_bg_rect(int32_t x0, int32_t y0, int32_t x1, int32_t y1, bool live_data)
{
    x0 = tof_clamp_i32(x0, TOF_TP_X0, TOF_TP_X1);
    x1 = tof_clamp_i32(x1, TOF_TP_X0, TOF_TP_X1);
    y0 = tof_clamp_i32(y0, TOF_TP_Y0, TOF_TP_Y1);
    y1 = tof_clamp_i32(y1, TOF_TP_Y0, TOF_TP_Y1);
    if (x1 < x0 || y1 < y0)
    {
        return;
    }

    const int32_t area_h = (TOF_TP_Y1 - TOF_TP_Y0) + 1;
    const int32_t bands = 6;
    for (int32_t band = 0; band < bands; band++)
    {
        const int32_t by0 = TOF_TP_Y0 + ((band * area_h) / bands);
        int32_t by1 = TOF_TP_Y0 + (((band + 1) * area_h) / bands) - 1;
        if (band == (bands - 1))
        {
            by1 = TOF_TP_Y1;
        }

        int32_t iy0 = (y0 > by0) ? y0 : by0;
        int32_t iy1 = (y1 < by1) ? y1 : by1;
        if (iy1 < iy0)
        {
            continue;
        }

        const uint32_t t = (uint32_t)((band * 255) / (bands - 1));
        display_hal_fill_rect(x0, iy0, x1, iy1, tof_tp_bg_color(t, live_data));
    }
}

static uint16_t tof_tp_paper_color(int32_t tone, bool live_data)
{
    tone = tof_clamp_i32(tone, 0, 255);
    int32_t r = 176 + ((tone * 70) / 255);
    int32_t g = 170 + ((tone * 68) / 255);
    int32_t b = 156 + ((tone * 62) / 255);
    if (!live_data)
    {
        r = (r * 3) / 4;
        g = (g * 3) / 4;
        b = (b * 3) / 4;
    }
    return pack_rgb565((uint32_t)r, (uint32_t)g, (uint32_t)b);
}

static uint16_t tof_tp_core_color(int32_t tone, bool live_data)
{
    tone = tof_clamp_i32(tone, 0, 255);
    int32_t r = 90 + ((tone * 82) / 255);
    int32_t g = 70 + ((tone * 64) / 255);
    int32_t b = 46 + ((tone * 44) / 255);
    if (!live_data)
    {
        r = (r * 3) / 4;
        g = (g * 3) / 4;
        b = (b * 3) / 4;
    }
    return pack_rgb565((uint32_t)r, (uint32_t)g, (uint32_t)b);
}

static void tof_draw_ellipse_ring(int32_t cx,
                                  int32_t cy,
                                  int32_t outer_rx,
                                  int32_t outer_ry,
                                  int32_t thickness,
                                  uint16_t ring_color,
                                  uint16_t fill_color)
{
    if (outer_rx <= 0 || outer_ry <= 0 || thickness <= 0)
    {
        return;
    }

    tof_draw_filled_ellipse(cx, cy, outer_rx, outer_ry, ring_color);
    const int32_t inner_rx = outer_rx - thickness;
    const int32_t inner_ry = outer_ry - thickness;
    if (inner_rx > 0 && inner_ry > 0)
    {
        tof_draw_filled_ellipse(cx, cy, inner_rx, inner_ry, fill_color);
    }
}

static uint16_t tof_tp_bar_color(uint32_t fullness_q10, bool live_data)
{
    if (fullness_q10 > 1024u)
    {
        fullness_q10 = 1024u;
    }

    const uint32_t full8 = ((fullness_q10 * 255u) + 512u) / 1024u;
    uint32_t r = 24u + (((255u - full8) * 220u) / 255u);
    uint32_t g = 24u + ((full8 * 220u) / 255u);
    uint32_t b = 16u;
    if (!live_data)
    {
        r = (r * 3u) / 4u;
        g = (g * 3u) / 4u;
    }
    return pack_rgb565(r, g, b);
}

static void tof_tp_bar_rect(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1)
{
    int32_t bx0 = TOF_TP_X0 + TOF_TP_BAR_MARGIN_X;
    int32_t bx1 = TOF_TP_X1 - TOF_TP_BAR_MARGIN_X;
    int32_t by1 = TOF_TP_Y1 - 8;
    int32_t by0 = by1 - TOF_TP_BAR_H;
    bx0 = tof_clamp_i32(bx0, TOF_TP_X0, TOF_TP_X1);
    bx1 = tof_clamp_i32(bx1, TOF_TP_X0, TOF_TP_X1);
    by0 = tof_clamp_i32(by0, TOF_TP_Y0, TOF_TP_Y1);
    by1 = tof_clamp_i32(by1, TOF_TP_Y0, TOF_TP_Y1);
    if (x0 != NULL)
    {
        *x0 = bx0;
    }
    if (y0 != NULL)
    {
        *y0 = by0;
    }
    if (x1 != NULL)
    {
        *x1 = bx1;
    }
    if (y1 != NULL)
    {
        *y1 = by1;
    }
}

static void tof_tp_status_rect(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1)
{
    int32_t bar_x0 = 0;
    int32_t bar_y0 = 0;
    int32_t bar_x1 = 0;
    int32_t bar_y1 = 0;
    tof_tp_bar_rect(&bar_x0, &bar_y0, &bar_x1, &bar_y1);

    int32_t sx0 = bar_x0;
    int32_t sx1 = bar_x1;
    int32_t sy1 = bar_y0 - TOF_TP_STATUS_GAP_Y;
    int32_t sy0 = sy1 - TOF_TP_STATUS_H + 1;

    sx0 = tof_clamp_i32(sx0, TOF_TP_X0, TOF_TP_X1);
    sx1 = tof_clamp_i32(sx1, TOF_TP_X0, TOF_TP_X1);
    sy0 = tof_clamp_i32(sy0, TOF_TP_Y0, TOF_TP_Y1);
    sy1 = tof_clamp_i32(sy1, TOF_TP_Y0, TOF_TP_Y1);
    if (sy1 <= sy0)
    {
        sy0 = TOF_TP_Y0 + 2;
        sy1 = sy0 + TOF_TP_STATUS_H - 1;
        if (sy1 > TOF_TP_Y1)
        {
            sy1 = TOF_TP_Y1;
            sy0 = tof_clamp_i32(sy1 - TOF_TP_STATUS_H + 1, TOF_TP_Y0, TOF_TP_Y1);
        }
    }

    if (x0 != NULL)
    {
        *x0 = sx0;
    }
    if (y0 != NULL)
    {
        *y0 = sy0;
    }
    if (x1 != NULL)
    {
        *x1 = sx1;
    }
    if (y1 != NULL)
    {
        *y1 = sy1;
    }
}

static uint32_t tof_roll_level_ref_fullness_q10(tof_roll_alert_level_t level)
{
    switch (level)
    {
        case kTofRollAlertFull:
            return 1024u;
        case kTofRollAlertMedium:
            return 512u;
        case kTofRollAlertLow:
            return 256u;
        case kTofRollAlertEmpty:
        default:
            return 0u;
    }
}

static void tof_draw_roll_status_banner(tof_roll_alert_level_t level, bool live_data)
{
    if (!s_dbg_force_redraw &&
        s_roll_status_prev_valid &&
        s_roll_status_prev_level == level &&
        s_roll_status_prev_live == live_data)
    {
        return;
    }

    int32_t x0 = 0;
    int32_t y0 = 0;
    int32_t x1 = 0;
    int32_t y1 = 0;
    tof_tp_status_rect(&x0, &y0, &x1, &y1);
    if (x1 < x0 || y1 < y0)
    {
        return;
    }

    const uint16_t frame = pack_rgb565(40u, 46u, 52u);
    const uint16_t tray = pack_rgb565(10u, 12u, 14u);
    display_hal_fill_rect(x0, y0, x1, y1, tray);
    display_hal_fill_rect(x0, y0, x1, y0, frame);
    display_hal_fill_rect(x0, y1, x1, y1, frame);
    display_hal_fill_rect(x0, y0, x0, y1, frame);
    display_hal_fill_rect(x1, y0, x1, y1, frame);

    const int32_t ix0 = x0 + 2;
    const int32_t ix1 = x1 - 2;
    const int32_t iy0 = y0 + 2;
    const int32_t iy1 = y1 - 2;
    if (ix1 >= ix0 && iy1 >= iy0)
    {
        const uint16_t fill = tof_tp_bar_color(tof_roll_level_ref_fullness_q10(level), live_data);
        display_hal_fill_rect(ix0, iy0, ix1, iy1, fill);
    }

    const char *msg = NULL;
    uint16_t fg = pack_rgb565(246u, 238u, 226u);
    tof_roll_status_style(level, &msg, NULL, NULL, &fg);
    const size_t n = strlen(msg);
    const int32_t text_w = (n > 0u) ? ((int32_t)(n * TOF_DBG_CHAR_ADV) - 2) : 0;
    const int32_t text_h = TOF_DBG_CHAR_H * TOF_DBG_SCALE;
    int32_t tx = x0 + ((x1 - x0 + 1 - text_w) / 2);
    int32_t ty = y0 + ((y1 - y0 + 1 - text_h) / 2);
    if (tx < (x0 + 2))
    {
        tx = x0 + 2;
    }
    if (ty < (y0 + 1))
    {
        ty = y0 + 1;
    }
    for (size_t i = 0u; i < n; i++)
    {
        tof_tiny_draw_char_clipped(tx, ty, msg[i], fg, x0, y0, x1, y1);
        tx += TOF_DBG_CHAR_ADV;
    }

    s_roll_status_prev_valid = true;
    s_roll_status_prev_level = level;
    s_roll_status_prev_live = live_data;
}

static void tof_draw_fullness_bar(uint32_t fullness_q10, uint32_t mm_q8, bool live_data)
{
    int32_t bar_x0 = 0;
    int32_t bar_y0 = 0;
    int32_t bar_x1 = 0;
    int32_t bar_y1 = 0;
    tof_tp_bar_rect(&bar_x0, &bar_y0, &bar_x1, &bar_y1);
    if (bar_x1 <= bar_x0 || bar_y1 <= bar_y0)
    {
        return;
    }

    const uint16_t frame = pack_rgb565(40u, 46u, 52u);
    const uint16_t tray = pack_rgb565(10u, 12u, 14u);
    const uint16_t bg = pack_rgb565(28u, 20u, 18u);
    display_hal_fill_rect(bar_x0, bar_y0, bar_x1, bar_y1, tray);
    display_hal_fill_rect(bar_x0, bar_y0, bar_x1, bar_y0, frame);
    display_hal_fill_rect(bar_x0, bar_y1, bar_x1, bar_y1, frame);
    display_hal_fill_rect(bar_x0, bar_y0, bar_x0, bar_y1, frame);
    display_hal_fill_rect(bar_x1, bar_y0, bar_x1, bar_y1, frame);

    const int32_t ix0 = bar_x0 + 2;
    const int32_t ix1 = bar_x1 - 2;
    const int32_t iy0 = bar_y0 + 2;
    const int32_t iy1 = bar_y1 - 2;
    const int32_t iw = ix1 - ix0 + 1;
    if (iw <= 0 || iy1 < iy0)
    {
        return;
    }

    display_hal_fill_rect(ix0, iy0, ix1, iy1, bg);
    if (fullness_q10 > 1024u)
    {
        fullness_q10 = 1024u;
    }

    int32_t fill_w = (int32_t)(((fullness_q10 * (uint32_t)iw) + 512u) / 1024u);
    if (fill_w > iw)
    {
        fill_w = iw;
    }
    if (fill_w > 0)
    {
        display_hal_fill_rect(ix0, iy0, ix0 + fill_w - 1, iy1, tof_tp_bar_color(fullness_q10, live_data));
    }
    (void)mm_q8;
}

