telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
static void tof_update_spool_model(const uint16_t mm[64], bool live_data, uint32_t tick, bool draw_enable)
{
    const bool force_now = s_tp_force_redraw && draw_enable;
    if (!force_now && (uint32_t)(tick - s_tp_last_tick) < TOF_TP_UPDATE_TICKS)
    {
        return;
    }

    /* Keep TP roll/bar scaling on a single measurement path regardless of AI/alert UI state. */
    const uint16_t *calc_mm = tof_calc_metric_frame(mm, live_data);
    uint16_t avg_mm = 0u;
    tof_calc_frame_stats(calc_mm, NULL, NULL, NULL, &avg_mm);
    uint16_t closest_mm = tof_calc_closest_valid_mm(calc_mm);
    const uint16_t curve_mm = tof_calc_roll_curve_distance_mm(calc_mm, NULL);
    s_tp_live_closest_mm = tof_apply_tp_mm_calibration(closest_mm);

    /* Roll radius should follow the nearest visible paper surface. Use closest
     * as the primary metric and only blend in curve lightly for stability.
     */
    uint16_t state_mm = 0u;
    if (closest_mm > 0u)
    {
        state_mm = closest_mm;
        if (curve_mm > 0u)
        {
            uint32_t blended = ((uint32_t)closest_mm * 3u) + (uint32_t)curve_mm;
            state_mm = (uint16_t)((blended + 2u) / 4u);
        }
    }
    else if (curve_mm > 0u)
    {
        state_mm = curve_mm;
    }
    else if (avg_mm > 0u)
    {
        state_mm = avg_mm;
    }

    state_mm = tof_apply_tp_mm_calibration(state_mm);
    if (s_ai_runtime_on && (state_mm > 0u))
    {
        uint32_t biased_mm = (uint32_t)state_mm + (uint32_t)TOF_AI_MODEL_MM_BIAS;
        if (biased_mm > TOF_TP_MM_CLIP_MAX)
        {
            biased_mm = TOF_TP_MM_CLIP_MAX;
        }
        state_mm = (uint16_t)biased_mm;
    }
    const bool full_capture_candidate = (s_tp_live_closest_mm > 0u) &&
                                        (s_tp_live_closest_mm <= TOF_ROLL_FULL_CAPTURE_MM);
    const bool full_capture_consensus = (state_mm == 0u) ||
                                        (state_mm <= (TOF_ROLL_FULL_CAPTURE_MM + 20u));
    const bool full_capture_lock = full_capture_candidate && full_capture_consensus;

    if (full_capture_lock &&
        ((state_mm == 0u) || (state_mm > (s_tp_live_closest_mm + 2u))))
    {
        /* When closest sample indicates full-roll distance, prefer it so
         * bar/state do not stick in medium from averaged far pixels.
         */
        state_mm = TOF_TP_MM_FULL_NEAR;
    }
    s_tp_live_actual_mm = state_mm;

    uint16_t actual_mm = state_mm;
    if (full_capture_lock &&
        ((actual_mm == 0u) || ((s_tp_live_closest_mm + 4u) < actual_mm)))
    {
        actual_mm = TOF_TP_MM_FULL_NEAR;
    }
    if (s_alert_popup_hold_empty &&
        full_capture_candidate &&
        ((s_tp_live_closest_mm + 8u) < actual_mm))
    {
        /* Only use aggressive closest-pixel pull while recovering from EMPTY hold. */
        actual_mm = TOF_TP_MM_FULL_NEAR;
    }

    bool snap_extreme = false;
    const uint32_t raw_mm_q8 = (actual_mm > 0u) ? ((uint32_t)actual_mm << 8) : 0u;
    if (raw_mm_q8 > 0u)
    {
        uint16_t snap_mm = actual_mm;
        snap_extreme = (snap_mm <= TOF_ROLL_FULL_CAPTURE_MM) ||
                       (snap_mm > TOF_ROLL_EMPTY_TRIGGER_MM);
        if (s_tp_mm_q8 == 0u || snap_extreme)
        {
            s_tp_mm_q8 = ((uint32_t)snap_mm << 8);
        }
        else
        {
            uint32_t delta_q8 = (s_tp_mm_q8 > raw_mm_q8) ? (s_tp_mm_q8 - raw_mm_q8) : (raw_mm_q8 - s_tp_mm_q8);
            if (delta_q8 >= (6u << 8))
            {
                s_tp_mm_q8 = (s_tp_mm_q8 + raw_mm_q8 + 1u) / 2u;
            }
            else
            {
                s_tp_mm_q8 = ((s_tp_mm_q8 * 3u) + raw_mm_q8 + 2u) / 4u;
            }
        }
    }
    s_tp_live_actual_mm = actual_mm;

    uint32_t model_mm_q8 = s_tp_mm_q8;

#if TOF_EST_ENABLE
    if (s_ai_runtime_on)
    {
        tof_estimator_update(calc_mm, live_data);
    }
#endif
    uint32_t fullness_q10 = tof_tp_fullness_q10_from_mm_q8_bounds(model_mm_q8,
                                                                   TOF_TP_MM_FULL_NEAR,
                                                                   TOF_TP_BAR_MM_EMPTY);
    if (fullness_q10 > 1024u)
    {
        fullness_q10 = 1024u;
    }
    uint32_t bar_fullness_q10 = fullness_q10;
    if (bar_fullness_q10 > 1024u)
    {
        bar_fullness_q10 = 1024u;
    }
    uint16_t bar_fullness_draw_q10 = (uint16_t)((((bar_fullness_q10 + 4u) / 8u) * 8u));
    if (bar_fullness_draw_q10 > 1024u)
    {
        bar_fullness_draw_q10 = 1024u;
    }
    s_roll_fullness_q10 = (uint16_t)fullness_q10;
    s_roll_model_mm = (model_mm_q8 > 0u) ? (uint16_t)((model_mm_q8 + 128u) >> 8) : 0u;
    if (s_roll_model_mm > TOF_TP_MM_CLIP_MAX)
    {
        s_roll_model_mm = TOF_TP_MM_CLIP_MAX;
    }

    const int32_t area_w = (TOF_TP_X1 - TOF_TP_X0) + 1;
    int32_t status_y0 = 0;
    tof_tp_status_rect(NULL, &status_y0, NULL, NULL);
    const int32_t roll_top = TOF_TP_Y0 + 6;
    int32_t roll_bottom = status_y0 - 6;
    if (roll_bottom < (roll_top + 24))
    {
        roll_bottom = roll_top + 24;
    }
    const int32_t roll_h = (roll_bottom - roll_top) + 1;
    const int32_t outer_ry_min = 34;
    int32_t outer_ry_max = (roll_h / 2) - 2;
    outer_ry_max = tof_clamp_i32(outer_ry_max, outer_ry_min, 92);
    if (outer_ry_max < outer_ry_min)
    {
        outer_ry_max = outer_ry_min;
    }

    const uint16_t fullness_geom_q10 = (uint16_t)((((fullness_q10 + 4u) / 8u) * 8u));
    const int32_t outer_ry = outer_ry_min +
        (int32_t)(((fullness_geom_q10 * (uint32_t)(outer_ry_max - outer_ry_min)) + 512u) / 1024u);
    const int32_t depth = tof_clamp_i32(14 + (outer_ry / 3), 14, 28);
    int32_t outer_rx_fit = ((area_w - depth) / 2) - 3;
    outer_rx_fit = tof_clamp_i32(outer_rx_fit, 32, 120);
    int32_t outer_rx_min = (outer_rx_fit * 58) / 100;
    outer_rx_min = tof_clamp_i32(outer_rx_min, 26, outer_rx_fit);
    if (outer_rx_min > outer_rx_fit)
    {
        outer_rx_min = outer_rx_fit;
    }
    const int32_t outer_rx = outer_rx_min +
        (int32_t)(((fullness_geom_q10 * (uint32_t)(outer_rx_fit - outer_rx_min)) + 512u) / 1024u);

