telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    const bool render_live = live_data || (model_mm_q8 > 0u);
    tof_ai_log_frame(mm, render_live, tick, fullness_q10);
    const bool roll_geom_changed = ((uint16_t)outer_ry != s_tp_last_outer_ry) ||
                                   ((uint16_t)outer_rx != s_tp_last_outer_rx);
    const uint32_t roll_delta_q8 = tof_abs_diff_u32(model_mm_q8, s_tp_last_roll_mm_q8);
    const bool roll_changed = s_tp_force_redraw ||
                              (render_live != s_tp_last_live) ||
                              (roll_geom_changed &&
                               (roll_delta_q8 >= ((uint32_t)TOF_TP_ROLL_REDRAW_MM_DELTA << 8)));
    const bool bar_changed = s_tp_force_redraw ||
                             (render_live != s_tp_last_live) ||
                             (bar_fullness_draw_q10 != s_tp_last_fullness_q10);

    if (!draw_enable)
    {
        s_tp_last_tick = tick;
        /* Redraw immediately once the popup releases, but keep model cadence stable meanwhile. */
        s_tp_force_redraw = true;
        return;
    }

    if (!roll_changed && !bar_changed)
    {
        s_tp_last_tick = tick;
        return;
    }

    if (roll_changed)
    {
        const int32_t core_ry = tof_clamp_i32((outer_ry * 56) / 100, 12, outer_ry - 8);
        const int32_t core_rx = tof_clamp_i32((outer_rx * 56) / 100, 12, outer_rx - 8);
        const int32_t hole_ry = tof_clamp_i32((core_ry * 60) / 100, 7, core_ry - 3);
        const int32_t hole_rx = tof_clamp_i32((core_rx * 60) / 100, 7, core_rx - 3);
        const int32_t center_x = TOF_TP_X0 + (area_w / 2);
        int32_t cy = roll_top + (roll_h / 2) - 6;
        cy = tof_clamp_i32(cy, roll_top + outer_ry + 2, roll_bottom - outer_ry - 2);
        const int32_t back_cx = center_x - (depth / 2);
        const int32_t front_cx = center_x + (depth / 2);

        int32_t roll_x0 = back_cx - outer_rx - 3;
        int32_t roll_x1 = front_cx + outer_rx + 3;
        int32_t roll_y0 = cy - outer_ry - 3;
        int32_t roll_y1 = cy + outer_ry + 8;

        if (s_tp_prev_rect_valid)
        {
            roll_x0 = (roll_x0 < s_tp_prev_x0) ? roll_x0 : s_tp_prev_x0;
            roll_y0 = (roll_y0 < s_tp_prev_y0) ? roll_y0 : s_tp_prev_y0;
            roll_x1 = (roll_x1 > s_tp_prev_x1) ? roll_x1 : s_tp_prev_x1;
            roll_y1 = (roll_y1 > s_tp_prev_y1) ? roll_y1 : s_tp_prev_y1;
        }
        tof_tp_fill_bg_rect(roll_x0, roll_y0, roll_x1, roll_y1, render_live);

        const int32_t shadow_y = tof_clamp_i32(cy + outer_ry + 2, TOF_TP_Y0, roll_bottom + 2);
        tof_draw_filled_ellipse(center_x + (depth / 8),
                                shadow_y,
                                outer_rx + (depth / 5),
                                tof_clamp_i32(outer_ry / 16, 2, 6),
                                pack_rgb565(8u, 8u, 10u));
        tof_draw_filled_ellipse(center_x + (depth / 10),
                                shadow_y - 1,
                                outer_rx + (depth / 7),
                                tof_clamp_i32(outer_ry / 20, 2, 4),
                                pack_rgb565(14u, 14u, 18u));

        for (int32_t y = -outer_ry; y <= outer_ry; y += 2)
        {
            const int32_t y_abs = (y < 0) ? -y : y;
            const int32_t py = cy + y;
            int32_t py1 = py + 1;
            if (py1 > TOF_TP_Y1)
            {
                py1 = TOF_TP_Y1;
            }
            if (py < TOF_TP_Y0 || py > TOF_TP_Y1)
            {
                continue;
            }

            const int32_t xw = tof_ellipse_half_width(outer_rx, outer_ry, y_abs);
            int32_t x0 = back_cx - xw + 1;
            int32_t x1 = front_cx + xw - 1;
            x0 = tof_clamp_i32(x0, TOF_TP_X0, TOF_TP_X1);
            x1 = tof_clamp_i32(x1, TOF_TP_X0, TOF_TP_X1);
            if (x1 < x0)
            {
                continue;
            }

            const int32_t tone = 168 + (((outer_ry - y_abs) * 44) / tof_clamp_i32(outer_ry, 1, 1024));
            display_hal_fill_rect(x0, py, x1, py1, tof_tp_paper_color(tone, render_live));
        }

        const uint16_t back_base = tof_tp_paper_color(110, render_live);
        tof_draw_filled_ellipse(back_cx, cy, outer_rx, outer_ry, back_base);
        tof_draw_ellipse_ring(back_cx, cy, outer_rx, outer_ry, 2, tof_tp_paper_color(84, render_live), back_base);
        tof_draw_filled_ellipse(back_cx, cy, hole_rx, hole_ry, pack_rgb565(18u, 16u, 14u));

        const uint16_t front_base = tof_tp_paper_color(232, render_live);
        tof_draw_filled_ellipse(front_cx, cy, outer_rx, outer_ry, front_base);
        tof_draw_ellipse_ring(front_cx, cy, outer_rx, outer_ry, 2, tof_tp_paper_color(168, render_live), front_base);

        for (int32_t i = 0; i < 4; i++)
        {
            const int32_t ry_layer = outer_ry - 3 - (i * 5);
            if (ry_layer <= (core_ry + 2))
            {
                break;
            }
            const int32_t rx_layer = (outer_rx * ry_layer) / outer_ry;
            const int32_t tone = 228 - (i * 16);
            tof_draw_ellipse_ring(front_cx,
                                  cy,
                                  rx_layer,
                                  ry_layer,
                                  1,
                                  tof_tp_paper_color(tone, render_live),
                                  front_base);
        }

        const uint16_t core_base = tof_tp_core_color(182, render_live);
        tof_draw_filled_ellipse(front_cx, cy, core_rx, core_ry, core_base);
        tof_draw_ellipse_ring(front_cx, cy, core_rx, core_ry, 2, tof_tp_core_color(118, render_live), core_base);
        tof_draw_filled_ellipse(front_cx, cy, hole_rx, hole_ry, pack_rgb565(24u, 22u, 20u));
        tof_draw_filled_ellipse(front_cx + 1,
                                cy - 1,
                                tof_clamp_i32((hole_rx * 68) / 100, 4, hole_rx),
                                tof_clamp_i32((hole_ry * 68) / 100, 4, hole_ry),
                                pack_rgb565(11u, 11u, 13u));

        s_tp_prev_x0 = (int16_t)tof_clamp_i32(back_cx - outer_rx - 3, TOF_TP_X0, TOF_TP_X1);
        s_tp_prev_y0 = (int16_t)tof_clamp_i32(cy - outer_ry - 3, TOF_TP_Y0, TOF_TP_Y1);
        s_tp_prev_x1 = (int16_t)tof_clamp_i32(front_cx + outer_rx + 3, TOF_TP_X0, TOF_TP_X1);
        s_tp_prev_y1 = (int16_t)tof_clamp_i32(cy + outer_ry + 8, TOF_TP_Y0, TOF_TP_Y1);
        s_tp_prev_rect_valid = true;
        s_tp_last_roll_mm_q8 = model_mm_q8;
    }

    if (bar_changed)
    {
        tof_draw_fullness_bar(bar_fullness_draw_q10, model_mm_q8, render_live);
    }

    s_tp_last_tick = tick;
    s_tp_last_outer_ry = (uint16_t)outer_ry;
    s_tp_last_outer_rx = (uint16_t)outer_rx;
    s_tp_last_fullness_q10 = bar_fullness_draw_q10;
    s_tp_last_live = render_live;
    s_tp_force_redraw = false;
}

static void tof_update_debug_panel(const uint16_t mm[64],
                                   bool live_data,
                                   bool got_live,
                                   bool got_complete,
                                   uint32_t stale_frames,
                                   uint32_t zero_live_frames,
                                   uint32_t tick)
{
    if (!s_dbg_force_redraw)
    {
        if ((uint32_t)(tick - s_dbg_last_tick) < TOF_DEBUG_UPDATE_TICKS)
        {
            return;
        }
    }
    s_dbg_last_tick = tick;

    if (s_dbg_force_redraw)
    {
        display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y1, s_ui_dbg_bg);
        display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y0, pack_rgb565(32u, 38u, 44u));
        memset(s_dbg_prev, 0, sizeof(s_dbg_prev));
        s_ai_pill_prev_valid = false;
        s_alert_pill_prev_valid = false;
    }

    uint32_t valid = 0u;
    uint16_t min_mm = 0u;
    uint16_t max_mm = 0u;
    uint16_t avg_mm = 0u;
    uint16_t actual_mm = 0u;
    uint16_t est_mm = (uint16_t)(s_tp_mm_q8 >> 8);
    uint16_t conf_q10 = s_est_conf_q10;
    uint16_t spread_mm = s_est_spread_mm;
    uint32_t est_valid = s_est_valid_count;
    uint16_t grid_noise_mm = s_ai_grid_noise_mm;
    uint32_t full_q10 = s_roll_fullness_q10;
    uint16_t fullness_pct = (uint16_t)((full_q10 * 100u + 512u) / 1024u);
    const uint16_t *calc_mm = tof_calc_metric_frame(mm, live_data);
    tof_calc_frame_stats(calc_mm, &valid, &min_mm, &max_mm, &avg_mm);
    uint16_t curve_mm = 0u;
    if (s_ai_runtime_on)
    {
        curve_mm = tof_calc_roll_curve_distance_mm(calc_mm, NULL);
    }
    uint16_t closest_mm = tof_calc_closest_valid_mm(calc_mm);
    uint16_t actual_candidates[3];
    uint32_t actual_count = 0u;
    if (avg_mm > 0u)
    {
        actual_candidates[actual_count++] = avg_mm;
    }
    if (curve_mm > 0u)
    {
        actual_candidates[actual_count++] = curve_mm;
    }
    if (closest_mm > 0u)
    {
        actual_candidates[actual_count++] = closest_mm;
    }
    actual_mm = (actual_count > 0u) ? tof_ai_grid_median_u16(actual_candidates, actual_count) : 0u;
    actual_mm = tof_apply_tp_mm_calibration(actual_mm);

    if (!s_ai_runtime_on)
    {
        conf_q10 = 0u;
        spread_mm = 0u;
        est_valid = 0u;
        grid_noise_mm = 0u;
    }

    char line[TOF_DBG_COLS + 1u];
    snprintf(line, sizeof(line), "LIVE:%u GL:%u GC:%u",
             live_data ? 1u : 0u,
             got_live ? 1u : 0u,
             got_complete ? 1u : 0u);
    tof_dbg_draw_line(0u, line, s_ui_dbg_fg);

    snprintf(line, sizeof(line), "TP:%u-%u",
             (unsigned)TOF_TP_MM_FULL_NEAR,
             (unsigned)TOF_TP_BAR_MM_EMPTY);
    tof_dbg_draw_line(1u, line, s_ui_dbg_fg);

    snprintf(line, sizeof(line), "AVG:%u EST:%u",
             (unsigned)avg_mm,
             (unsigned)est_mm);
    tof_dbg_draw_line(2u, line, s_ui_dbg_fg);

    snprintf(line, sizeof(line), "CF:%u FQ:%u",
             (unsigned)conf_q10,
             (unsigned)fullness_pct);
    tof_dbg_draw_line(3u, line, s_ui_dbg_dim);

    snprintf(line, sizeof(line), "V:%lu SP:%u",
             (unsigned long)est_valid,
             (unsigned)spread_mm);
    tof_dbg_draw_line(4u, line, s_ui_dbg_dim);

    snprintf(line, sizeof(line), "AI:%u A:%u N:%u",
             (unsigned)(s_ai_runtime_on ? 1u : 0u),
             (unsigned)actual_mm,
             (unsigned)grid_noise_mm);
    tof_dbg_draw_line(5u, line, s_ui_dbg_dim);

    (void)stale_frames;
    (void)zero_live_frames;
    (void)valid;
    (void)min_mm;
    (void)max_mm;
    tof_draw_ai_pill(s_ai_runtime_on);

    s_dbg_force_redraw = false;
}

static void tof_build_layout(void)
{
    const int32_t gap_px = TOF_CELL_GAP;
    const int32_t q1_w = TOF_Q_W;
    const int32_t q1_top_h = (TOF_Q1_TOP_Y1 - TOF_Q1_TOP_Y0) + 1;
    const int32_t cell_px_w = (q1_w - ((TOF_GRID_W - 1) * gap_px)) / TOF_GRID_W;
    const int32_t cell_px_h = (q1_top_h - ((TOF_GRID_H - 1) * gap_px)) / TOF_GRID_H;
    int32_t cell_px = (cell_px_w < cell_px_h) ? cell_px_w : cell_px_h;
    if (cell_px < 3)
    {
        cell_px = 3;
    }
    const int32_t grid_w_px = (TOF_GRID_W * cell_px) + ((TOF_GRID_W - 1) * gap_px);
    const int32_t grid_h_px = (TOF_GRID_H * cell_px) + ((TOF_GRID_H - 1) * gap_px);
    int32_t x0 = TOF_Q1_X0 + ((q1_w - grid_w_px) / 2);
    int32_t y0 = TOF_Q1_TOP_Y0 + ((q1_top_h - grid_h_px) / 2);

    x0 = tof_clamp_i32(x0, TOF_Q1_X0, TOF_Q1_X1 - grid_w_px + 1);
    y0 = tof_clamp_i32(y0, TOF_Q1_TOP_Y0, TOF_Q1_TOP_Y1 - grid_h_px + 1);

    s_dbg_x0 = (int16_t)x0;
    s_dbg_y0 = TOF_Q1_BOT_Y0;
    s_dbg_x1 = (int16_t)(x0 + grid_w_px - 1);
    s_dbg_y1 = TOF_Q1_BOT_Y1;
    s_ai_pill_x0 = (int16_t)(s_dbg_x0 + TOF_AI_PILL_MARGIN_X);
    s_ai_pill_x1 = (int16_t)(s_dbg_x1 - TOF_AI_PILL_MARGIN_X);
    s_ai_pill_y1 = (int16_t)(s_dbg_y1 - TOF_AI_PILL_MARGIN_BOTTOM);
    s_ai_pill_y0 = (int16_t)(s_ai_pill_y1 - TOF_AI_PILL_H + 1);
    if (s_ai_pill_y0 < (s_dbg_y0 + 1))
    {
        s_ai_pill_y0 = (int16_t)(s_dbg_y0 + 1);
    }
    s_alert_pill_x0 = s_ai_pill_x0;
    s_alert_pill_x1 = s_ai_pill_x1;
    s_alert_pill_y1 = (int16_t)(s_ai_pill_y0 - TOF_ALERT_PILL_GAP_Y);
    s_alert_pill_y0 = (int16_t)(s_alert_pill_y1 - TOF_ALERT_PILL_H + 1);
    if (s_alert_pill_y0 < (s_dbg_y0 + 1))
    {
        s_alert_pill_y0 = (int16_t)(s_dbg_y0 + 1);
        s_alert_pill_y1 = (int16_t)(s_alert_pill_y0 + TOF_ALERT_PILL_H - 1);
    }

    for (int32_t gy = 0; gy < TOF_GRID_H; gy++)
    {
        for (int32_t gx = 0; gx < TOF_GRID_W; gx++)
        {
            const int32_t idx = gy * TOF_GRID_W + gx;
            const int32_t cell_x = x0 + gx * (cell_px + gap_px);
            const int32_t cell_y = y0 + gy * (cell_px + gap_px);

            s_cells[idx].x0 = (int16_t)cell_x;
            s_cells[idx].y0 = (int16_t)cell_y;
            s_cells[idx].x1 = (int16_t)(cell_x + cell_px - 1);
            s_cells[idx].y1 = (int16_t)(cell_y + cell_px - 1);
            s_cells[idx].ix0 = (int16_t)(cell_x + TOF_CELL_INSET);
            s_cells[idx].iy0 = (int16_t)(cell_y + TOF_CELL_INSET);
            s_cells[idx].ix1 = (int16_t)(cell_x + cell_px - TOF_CELL_INSET - 1);
            s_cells[idx].iy1 = (int16_t)(cell_y + cell_px - TOF_CELL_INSET - 1);
        }
    }
}

