telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
static void tof_draw_outline(const tof_cell_rect_t *c, uint16_t color)
{
    const int32_t x0 = c->ix0 - 1;
    const int32_t y0 = c->iy0 - 1;
    const int32_t x1 = c->ix1 + 1;
    const int32_t y1 = c->iy1 + 1;

    display_hal_fill_rect(x0, y0, x1, y0, color);
    display_hal_fill_rect(x0, y1, x1, y1, color);
    display_hal_fill_rect(x0, y0, x0, y1, color);
    display_hal_fill_rect(x1, y0, x1, y1, color);
}

static void tof_draw_curve_pick_overlay(bool show_overlay)
{
    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        const int32_t prev_idx = s_curve_prev_pick_idx[y];
        const int32_t next_idx = (show_overlay) ? s_curve_pick_idx[y] : -1;
        if (prev_idx == next_idx)
        {
            continue;
        }

        if (prev_idx >= 0 && prev_idx < 64)
        {
            const uint16_t restore = (prev_idx == s_hot_idx) ? s_ui_hot : s_ui_border;
            tof_draw_outline(&s_cells[prev_idx], restore);
        }

        if (next_idx >= 0 && next_idx < 64)
        {
            tof_draw_outline(&s_cells[next_idx], s_ui_pick);
        }

        s_curve_prev_pick_idx[y] = (int16_t)next_idx;
    }
}

static void tof_ui_init(void)
{
    s_ui_bg = pack_rgb565(3u, 4u, 6u);
    s_ui_border = pack_rgb565(16u, 18u, 22u);
    s_ui_hot = pack_rgb565(255u, 255u, 255u);
    s_ui_pick = pack_rgb565(56u, 242u, 255u);
    s_ui_invalid = pack_rgb565(14u, 14u, 18u);
    s_ui_below_range = pack_rgb565(0u, 220u, 0u);
    s_ui_above_range = pack_rgb565(56u, 8u, 8u);
    s_ui_dbg_bg = pack_rgb565(6u, 8u, 10u);
    s_ui_dbg_fg = pack_rgb565(210u, 220u, 230u);
    s_ui_dbg_dim = pack_rgb565(120u, 132u, 146u);

    tof_build_layout();
    display_hal_fill(s_ui_bg);
    display_hal_fill_rect(TOF_TP_X0, TOF_TP_Y0, TOF_TP_X1, TOF_TP_Y1, tof_tp_bg_color(255u, true));
    display_hal_fill_rect(TOF_Q_W, 0, TOF_Q_W, TOF_LCD_H - 1, pack_rgb565(20u, 24u, 28u));
    display_hal_fill_rect(s_dbg_x0, TOF_Q1_BOT_Y0, s_dbg_x1, TOF_Q1_BOT_Y0, pack_rgb565(28u, 32u, 36u));
    display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y1, s_ui_dbg_bg);
    display_hal_fill_rect(s_dbg_x0, s_dbg_y0, s_dbg_x1, s_dbg_y0, pack_rgb565(32u, 38u, 44u));

    for (uint32_t i = 0; i < 64u; i++)
    {
        const tof_cell_rect_t *c = &s_cells[i];
        display_hal_fill_rect(c->x0, c->y0, c->x1, c->y1, s_ui_border);
        display_hal_fill_rect(c->ix0, c->iy0, c->ix1, c->iy1, s_ui_bg);
    }

    memset(s_filtered_mm, 0, sizeof(s_filtered_mm));
    memset(s_display_mm, 0, sizeof(s_display_mm));
    memset(s_last_cell_color, 0, sizeof(s_last_cell_color));
    memset(s_cell_drawn, 0, sizeof(s_cell_drawn));
    memset(s_invalid_age, 0, sizeof(s_invalid_age));
    memset(s_display_age, 0, sizeof(s_display_age));
    memset(s_dbg_prev, 0, sizeof(s_dbg_prev));
    s_hot_idx = -1;
    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        s_curve_pick_idx[y] = -1;
        s_curve_prev_pick_idx[y] = -1;
    }
    s_range_near_mm = TOF_LOCKED_NEAR_MM;
    s_range_far_mm = TOF_LOCKED_FAR_MM;
    s_dbg_last_tick = 0u;
    s_dbg_force_redraw = true;
    s_ai_pill_prev_valid = false;
    s_ai_pill_prev_on = false;
    s_alert_pill_prev_valid = false;
    s_alert_pill_prev_on = true;
    s_ai_runtime_on = (TOF_AI_DATA_LOG_ENABLE != 0u);
    s_alert_runtime_on = false;
    s_tp_last_tick = 0u;
    s_tp_last_outer_ry = 0u;
    s_tp_last_outer_rx = 0u;
    s_tp_last_fullness_q10 = 0u;
    s_tp_last_roll_mm_q8 = 0u;
    s_tp_mm_q8 = 0u;
    s_tp_live_actual_mm = 0u;
    s_tp_live_closest_mm = 0u;
    s_tp_last_live = false;
    s_tp_prev_rect_valid = false;
    s_tp_prev_x0 = 0;
    s_tp_prev_y0 = 0;
    s_tp_prev_x1 = 0;
    s_tp_prev_y1 = 0;
    s_ai_log_last_tick = 0u;
    s_est_near_mm = TOF_TP_MM_FULL_NEAR;
    s_est_far_mm = TOF_TP_MM_EMPTY_FAR;
    s_est_mm_q8 = 0u;
    s_est_conf_q10 = 0u;
    s_est_fullness_q10 = 640u;
    s_est_valid_count = 0u;
    s_est_spread_mm = 0u;
    s_roll_fullness_q10 = 640u;
    s_roll_model_mm = 0u;
    s_roll_alert_prev_level = kTofRollAlertFull;
    s_roll_alert_prev_valid = false;
    s_roll_status_prev_level = kTofRollAlertFull;
    s_roll_status_prev_valid = false;
    s_roll_status_prev_live = false;
    s_alert_popup_active = false;
    s_alert_popup_prev_drawn = false;
    s_alert_popup_rearm_on_full = true;
    s_alert_popup_hold_empty = false;
    s_alert_low_popup_shown = false;
    s_roll_full_rearm_streak = 0u;
    s_alert_popup_level = kTofRollAlertLow;
    s_alert_popup_prev_level = kTofRollAlertLow;
    s_alert_popup_until_tick = 0u;
    s_alert_popup_last_live = false;
    s_alert_popup_prev_x0 = 0;
    s_alert_popup_prev_y0 = 0;
    s_alert_popup_prev_x1 = 0;
    s_alert_popup_prev_y1 = 0;
    s_touch_was_down = false;
    s_touch_last_poll_tick = 0u;
    s_tp_force_redraw = true;
    tof_ai_grid_reset();
}

static void tof_ai_grid_reset(void)
{
    memset(s_ai_grid_mm, 0, sizeof(s_ai_grid_mm));
    memset(s_ai_grid_hold_age, 0, sizeof(s_ai_grid_hold_age));
    s_ai_grid_noise_mm = 0u;
}

static uint16_t tof_ai_grid_median_u16(uint16_t *values, uint32_t count)
{
    if (count == 0u)
    {
        return 0u;
    }

    for (uint32_t i = 1u; i < count; i++)
    {
        const uint16_t key = values[i];
        int32_t j = (int32_t)i - 1;
        while ((j >= 0) && (values[(uint32_t)j] > key))
        {
            values[(uint32_t)j + 1u] = values[(uint32_t)j];
            j--;
        }
        values[(uint32_t)j + 1u] = key;
    }

    return values[count / 2u];
}

static uint16_t tof_ai_grid_outlier_threshold_mm(uint16_t spread_mm)
{
    uint32_t threshold = TOF_AI_GRID_OUTLIER_MM_MIN + (spread_mm / 12u);
    if (threshold < TOF_AI_GRID_OUTLIER_MM_MIN)
    {
        threshold = TOF_AI_GRID_OUTLIER_MM_MIN;
    }
    if (threshold > TOF_AI_GRID_OUTLIER_MM_MAX)
    {
        threshold = TOF_AI_GRID_OUTLIER_MM_MAX;
    }
    return (uint16_t)threshold;
}

static void tof_ai_denoise_heatmap_frame(const uint16_t in_mm[64], uint16_t out_mm[64], bool live_data)
{
#if TOF_AI_GRID_ENABLE
    if (!live_data)
    {
        for (uint32_t i = 0u; i < 64u; i++)
        {
            const uint16_t raw = in_mm[i];
            uint16_t next = s_ai_grid_mm[i];

            if (tof_mm_valid(raw))
            {
                next = raw;
                s_ai_grid_hold_age[i] = 0u;
            }
            else if (tof_mm_valid(next))
            {
                next = (uint16_t)(((uint32_t)next * 31u) / 32u);
                if (next < 8u)
                {
                    next = 0u;
                }
            }

            s_ai_grid_mm[i] = next;
            out_mm[i] = next;
        }

