telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
        s_ai_grid_noise_mm = 0u;
        return;
    }

    uint32_t valid_count = 0u;
    uint16_t min_mm = 0xFFFFu;
    uint16_t max_mm = 0u;
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = in_mm[i];
        if (!tof_mm_valid(v))
        {
            continue;
        }

        valid_count++;
        if (v < min_mm)
        {
            min_mm = v;
        }
        if (v > max_mm)
        {
            max_mm = v;
        }
    }

    const uint16_t spread_mm = (valid_count > 0u) ? (uint16_t)(max_mm - min_mm) : 0u;
    const uint16_t outlier_threshold_mm = tof_ai_grid_outlier_threshold_mm(spread_mm);
    const uint16_t conf_q10 = tof_estimator_confidence_q10(valid_count, spread_mm, live_data);

    uint16_t candidate[64];
    uint32_t noise_sum = 0u;
    uint32_t noise_count = 0u;

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint32_t idx = (y * TOF_GRID_W) + x;
            const uint16_t raw = in_mm[idx];

            uint16_t neighbors[9];
            uint32_t ncount = 0u;
            for (int32_t dy = -1; dy <= 1; dy++)
            {
                for (int32_t dx = -1; dx <= 1; dx++)
                {
                    const int32_t nx = (int32_t)x + dx;
                    const int32_t ny = (int32_t)y + dy;
                    if (nx < 0 || nx >= TOF_GRID_W || ny < 0 || ny >= TOF_GRID_H)
                    {
                        continue;
                    }

                    const uint16_t nv = in_mm[(uint32_t)ny * TOF_GRID_W + (uint32_t)nx];
                    if (tof_mm_valid(nv))
                    {
                        neighbors[ncount++] = nv;
                    }
                }
            }

            uint16_t pred = 0u;
            bool have_pred = false;
            if (ncount >= TOF_AI_GRID_NEIGHBOR_MIN)
            {
                pred = tof_ai_grid_median_u16(neighbors, ncount);
                have_pred = true;
            }
            else if (tof_mm_valid(s_ai_grid_mm[idx]))
            {
                pred = s_ai_grid_mm[idx];
                have_pred = true;
            }

            if (tof_mm_valid(raw))
            {
                uint16_t fused = raw;
                if (have_pred)
                {
                    const uint16_t delta = tof_abs_diff_u16(raw, pred);
                    noise_sum += delta;
                    noise_count++;
                    if (delta > outlier_threshold_mm)
                    {
                        fused = (uint16_t)((((uint32_t)pred * 3u) + raw + 2u) / 4u);
                    }
                    else if (delta > (outlier_threshold_mm / 2u))
                    {
                        fused = (uint16_t)(((uint32_t)pred + raw + 1u) / 2u);
                    }
                }
                candidate[idx] = fused;
            }
            else if (have_pred)
            {
                candidate[idx] = pred;
            }
            else
            {
                candidate[idx] = 0u;
            }
        }
    }

    uint32_t slow_den = 6u;
    if (conf_q10 >= 768u)
    {
        slow_den = 3u;
    }
    else if (conf_q10 >= 512u)
    {
        slow_den = 4u;
    }
    else if (conf_q10 >= 256u)
    {
        slow_den = 5u;
    }

    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t prev = s_ai_grid_mm[i];
        const uint16_t cur = candidate[i];
        uint16_t next = 0u;

        if (tof_mm_valid(cur))
        {
            if (tof_mm_valid(prev))
            {
                const uint16_t delta = tof_abs_diff_u16(prev, cur);
                const uint32_t den = (delta >= TOF_AI_GRID_FAST_DELTA_MM) ? 2u : slow_den;
                next = (uint16_t)(((uint32_t)prev * (den - 1u) + cur + (den / 2u)) / den);
            }
            else
            {
                next = cur;
            }
            s_ai_grid_hold_age[i] = 0u;
        }
        else if (tof_mm_valid(prev) && (s_ai_grid_hold_age[i] < TOF_AI_GRID_HOLD_FRAMES))
        {
            s_ai_grid_hold_age[i]++;
            next = prev;
        }
        else if (tof_mm_valid(prev))
        {
            next = (uint16_t)(((uint32_t)prev * 31u) / 32u);
            if (next < 8u)
            {
                next = 0u;
            }
        }
        else
        {
            next = 0u;
        }

        s_ai_grid_mm[i] = next;
        out_mm[i] = next;
    }

    s_ai_grid_noise_mm = (noise_count > 0u) ? (uint16_t)(noise_sum / noise_count) : 0u;
#else
    memcpy(out_mm, in_mm, sizeof(uint16_t) * 64u);
    (void)live_data;
    s_ai_grid_noise_mm = 0u;
#endif
}

#if !TOF_DEBUG_RAW_DRAW
static void tof_filter_frame(const uint16_t in_mm[64], bool live_data)
{
    for (uint32_t i = 0; i < 64u; i++)
    {
        uint16_t sample = in_mm[i];

        if (!live_data)
        {
            s_filtered_mm[i] = sample;
            s_invalid_age[i] = 0u;
            continue;
        }

        if (!tof_mm_valid(sample))
        {
            if (s_filtered_mm[i] > 0u)
            {
                if (s_invalid_age[i] < TOF_INVALID_HOLD_FRAMES)
                {
                    s_invalid_age[i]++;
                }
                else
                {
                    s_filtered_mm[i] = (uint16_t)(((uint32_t)s_filtered_mm[i] * 31u) / 32u);
                }
            }
            continue;
        }

        s_invalid_age[i] = 0u;
        if (s_filtered_mm[i] == 0u)
        {
            s_filtered_mm[i] = sample;
        }
        else
        {
            s_filtered_mm[i] = (uint16_t)(((uint32_t)s_filtered_mm[i] + sample + 1u) / 2u);
        }
    }
}

static void tof_spatial_postprocess(uint16_t mm[64], bool live_data)
{
    if (!live_data)
    {
        return;
    }

    uint16_t src[64];
    memcpy(src, mm, sizeof(src));

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint32_t idx = (y * TOF_GRID_W) + x;
            if (tof_mm_valid(src[idx]))
            {
                continue;
            }

