telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
            uint32_t sum = 0u;
            uint32_t count = 0u;
            for (int32_t dy = -1; dy <= 1; dy++)
            {
                for (int32_t dx = -1; dx <= 1; dx++)
                {
                    if (dx == 0 && dy == 0)
                    {
                        continue;
                    }

                    const int32_t nx = (int32_t)x + dx;
                    const int32_t ny = (int32_t)y + dy;
                    if (nx < 0 || nx >= TOF_GRID_W || ny < 0 || ny >= TOF_GRID_H)
                    {
                        continue;
                    }

                    const uint16_t v = src[(uint32_t)ny * TOF_GRID_W + (uint32_t)nx];
                    if (tof_mm_valid(v))
                    {
                        sum += v;
                        count++;
                    }
                }
            }

            if (count >= 1u)
            {
                mm[idx] = (uint16_t)(sum / count);
            }
        }
    }

    uint32_t valid_count = 0u;
    uint32_t sum = 0u;
    uint16_t min_mm = 0xFFFFu;
    uint16_t max_mm = 0u;
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (tof_mm_valid(v))
        {
            valid_count++;
            sum += v;
            if (v < min_mm)
            {
                min_mm = v;
            }
            if (v > max_mm)
            {
                max_mm = v;
            }
        }
    }

    if (valid_count >= TOF_FLAT_VALID_MIN)
    {
        const uint16_t mean_mm = (uint16_t)(sum / valid_count);
        const uint16_t spread_mm = (uint16_t)(max_mm - min_mm);
        if (spread_mm <= TOF_FLAT_SPREAD_MM)
        {
            const uint16_t lo = (mean_mm > TOF_FLAT_CLAMP_MM) ? (uint16_t)(mean_mm - TOF_FLAT_CLAMP_MM) : 0u;
            const uint16_t hi = (uint16_t)(mean_mm + TOF_FLAT_CLAMP_MM);
            for (uint32_t i = 0u; i < 64u; i++)
            {
                uint16_t v = mm[i];
                if (!tof_mm_valid(v))
                {
                    mm[i] = mean_mm;
                    continue;
                }

                if (v < lo)
                {
                    v = lo;
                }
                else if (v > hi)
                {
                    v = hi;
                }
                mm[i] = v;
            }
        }
    }
}

static void tof_compose_display_frame(bool live_data)
{
    if (!live_data)
    {
        memcpy(s_display_mm, s_filtered_mm, sizeof(s_display_mm));
        memset(s_display_age, 0, sizeof(s_display_age));
        return;
    }

    uint16_t src[64];
    memcpy(src, s_filtered_mm, sizeof(src));

    uint32_t valid_count = 0u;
    uint32_t sum = 0u;
    uint16_t min_mm = 0xFFFFu;
    uint16_t max_mm = 0u;
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = src[i];
        if (tof_mm_valid(v))
        {
            valid_count++;
            sum += v;
            if (v < min_mm)
            {
                min_mm = v;
            }
            if (v > max_mm)
            {
                max_mm = v;
            }
        }
    }

    const uint16_t mean_mm = (valid_count > 0u) ? (uint16_t)(sum / valid_count) : 0u;

    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint32_t idx = (y * TOF_GRID_W) + x;
            if (tof_mm_valid(src[idx]))
            {
                continue;
            }

            uint32_t nsum = 0u;
            uint32_t ncount = 0u;
            for (int32_t dy = -1; dy <= 1; dy++)
            {
                for (int32_t dx = -1; dx <= 1; dx++)
                {
                    if (dx == 0 && dy == 0)
                    {
                        continue;
                    }

                    const int32_t nx = (int32_t)x + dx;
                    const int32_t ny = (int32_t)y + dy;
                    if (nx < 0 || nx >= TOF_GRID_W || ny < 0 || ny >= TOF_GRID_H)
                    {
                        continue;
                    }

                    const uint16_t v = src[(uint32_t)ny * TOF_GRID_W + (uint32_t)nx];
                    if (tof_mm_valid(v))
                    {
                        nsum += v;
                        ncount++;
                    }
                }
            }

            if (ncount > 0u)
            {
                src[idx] = (uint16_t)(nsum / ncount);
            }
            else if (valid_count >= TOF_MEAN_FILL_MIN_VALID)
            {
                src[idx] = mean_mm;
            }
        }
    }

    valid_count = 0u;
    sum = 0u;
    min_mm = 0xFFFFu;
    max_mm = 0u;
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = src[i];
        if (tof_mm_valid(v))
        {
            valid_count++;
            sum += v;
            if (v < min_mm)
            {
                min_mm = v;
            }
            if (v > max_mm)
            {
                max_mm = v;
            }
        }
    }

    if (valid_count > 0u)
    {
        const uint16_t flat_mean_mm = (uint16_t)(sum / valid_count);
        const uint16_t spread_mm = (uint16_t)(max_mm - min_mm);
        if (valid_count >= TOF_FLAT_VALID_MIN && spread_mm <= TOF_FLAT_SPREAD_MM)
        {
            const uint16_t lo = (flat_mean_mm > TOF_FLAT_CLAMP_MM) ? (uint16_t)(flat_mean_mm - TOF_FLAT_CLAMP_MM) : 0u;
            const uint16_t hi = (uint16_t)(flat_mean_mm + TOF_FLAT_CLAMP_MM);

            for (uint32_t i = 0u; i < 64u; i++)
            {
                uint16_t v = src[i];
                if (!tof_mm_valid(v))
                {
                    src[i] = flat_mean_mm;
                    continue;
                }

                if (v < lo)
                {
                    v = lo;
                }
                else if (v > hi)
                {
                    v = hi;
                }

                /* Pull each valid cell toward the frame mean for flatter surfaces. */
                src[i] = (uint16_t)((((uint32_t)v * 2u) + flat_mean_mm + 1u) / 3u);
            }
        }
    }

