telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = src[i];
        if (tof_mm_valid(v))
        {
            if (tof_mm_valid(s_display_mm[i]))
            {
                s_display_mm[i] = (uint16_t)((((uint32_t)s_display_mm[i] * 2u) + v + 1u) / 3u);
            }
            else
            {
                s_display_mm[i] = v;
            }
            s_display_age[i] = 0u;
            continue;
        }

        if (tof_mm_valid(s_display_mm[i]) && s_display_age[i] < TOF_DISPLAY_HOLD_FRAMES)
        {
            s_display_age[i]++;
            continue;
        }

        if (tof_mm_valid(s_display_mm[i]))
        {
            s_display_mm[i] = (uint16_t)(((uint32_t)s_display_mm[i] * 63u) / 64u);
            if (s_display_mm[i] < 8u)
            {
                s_display_mm[i] = 0u;
            }
        }
    }

    uint16_t smooth[64];
    memcpy(smooth, s_display_mm, sizeof(smooth));
    for (uint32_t y = 0u; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0u; x < TOF_GRID_W; x++)
        {
            const uint32_t idx = (y * TOF_GRID_W) + x;
            uint32_t ssum = 0u;
            uint32_t scount = 0u;
            for (int32_t dy = -1; dy <= 1; dy++)
            {
                for (int32_t dx = -1; dx <= 1; dx++)
                {
                    const int32_t nx = (int32_t)x + dx;
                    const int32_t ny = (int32_t)y + dy;
                    if (nx < 0 || nx >= TOF_GRID_W || ny < 0 || ny >= TOF_GRID_H)
                    {
                        continue;
                    }

                    const uint16_t v = s_display_mm[(uint32_t)ny * TOF_GRID_W + (uint32_t)nx];
                    if (tof_mm_valid(v))
                    {
                        ssum += v;
                        scount++;
                    }
                }
            }

            if (scount >= 2u)
            {
                smooth[idx] = (uint16_t)(ssum / scount);
            }
        }
    }
    memcpy(s_display_mm, smooth, sizeof(s_display_mm));
}
#endif

static uint32_t tof_count_valid(const uint16_t mm[64])
{
    uint32_t valid = 0u;
    for (uint32_t i = 0; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (tof_mm_valid(v))
        {
            valid++;
        }
    }
    return valid;
}

static void TOF_UNUSED tof_trace_quadrant_means(const uint16_t mm[64], uint32_t cycle_idx)
{
    uint32_t q_sum[4] = {0u, 0u, 0u, 0u};
    uint32_t q_cnt[4] = {0u, 0u, 0u, 0u};

    for (uint32_t y = 0u; y < 8u; y++)
    {
        for (uint32_t x = 0u; x < 8u; x++)
        {
            const uint32_t idx = (y * 8u) + x;
            const uint16_t v = mm[idx];
            if (!tof_mm_valid(v))
            {
                continue;
            }

            const uint32_t q = ((y >= 4u) ? 2u : 0u) | ((x >= 4u) ? 1u : 0u);
            q_sum[q] += v;
            q_cnt[q]++;
        }
    }

    const uint32_t q00 = (q_cnt[0] > 0u) ? (q_sum[0] / q_cnt[0]) : 0u;
    const uint32_t q01 = (q_cnt[1] > 0u) ? (q_sum[1] / q_cnt[1]) : 0u;
    const uint32_t q10 = (q_cnt[2] > 0u) ? (q_sum[2] / q_cnt[2]) : 0u;
    const uint32_t q11 = (q_cnt[3] > 0u) ? (q_sum[3] / q_cnt[3]) : 0u;
    const uint32_t valid = q_cnt[0] + q_cnt[1] + q_cnt[2] + q_cnt[3];

    PRINTF("TOF SYN: cycle=%u map=%u q00=%u q01=%u q10=%u q11=%u valid=%u\r\n",
           (unsigned)cycle_idx,
           (unsigned)TOF_SYNTH_MAP_MODE,
           (unsigned)q00,
           (unsigned)q01,
           (unsigned)q10,
           (unsigned)q11,
           (unsigned)valid);
}

static void TOF_UNUSED tof_fill_synth_fixed(uint16_t out_mm[64], uint32_t tick)
{
    const uint32_t drift = (tick / 6u) & 0x3Fu;
    for (uint32_t y = 0u; y < 8u; y++)
    {
        for (uint32_t x = 0u; x < 8u; x++)
        {
            const uint32_t idx = (y * 8u) + x;
            uint32_t mm = 350u + (x * 140u) + (y * 90u);
            mm += ((x + y + drift) & 0x7u) * 25u;
            out_mm[idx] = (uint16_t)mm;
        }
    }
}

static uint32_t TOF_UNUSED tof_synth_zone_index_8x8(uint32_t capture, uint32_t zone16)
{
    uint32_t x = 0u;
    uint32_t y = 0u;

#if (TOF_SYNTH_MAP_MODE == 1u)
    x = (zone16 & 0x3u) + ((capture & 0x1u) << 2u);
    y = ((zone16 >> 2u) & 0x3u) + (((capture >> 1u) & 0x1u) << 2u);
#elif (TOF_SYNTH_MAP_MODE == 2u)
    x = zone16 & 0x7u;
    y = ((zone16 >> 3u) & 0x1u) + (capture << 1u);
#elif (TOF_SYNTH_MAP_MODE == 3u)
    x = ((zone16 >> 3u) & 0x1u) + (capture << 1u);
    y = zone16 & 0x7u;
#else
    const uint32_t phase_x = capture & 0x1u;
    const uint32_t phase_y = (capture >> 1u) & 0x1u;
    const uint32_t local_x = zone16 & 0x3u;
    const uint32_t local_y = (zone16 >> 2u) & 0x3u;
    x = (local_x << 1u) | phase_x;
    y = (local_y << 1u) | phase_y;
#endif

    return (y * 8u) + x;
}

static bool TOF_UNUSED tof_fill_synth_subcap(uint16_t out_mm[64], uint32_t tick)
{
    const uint32_t capture = s_synth_subcap_capture;
    const uint16_t wave = (uint16_t)(((tick / 4u) & 0xFu) * 8u);

    for (uint32_t zone16 = 0u; zone16 < 16u; zone16++)
    {
        const uint32_t local_x = zone16 & 0x3u;
        const uint32_t local_y = (zone16 >> 2u) & 0x3u;
        const uint32_t dst = tof_synth_zone_index_8x8(capture, zone16);
        if (dst >= 64u)
        {
            continue;
        }

        const uint16_t base = (uint16_t)(700u + (capture * 600u));
        const uint16_t cell = (uint16_t)(base + (local_x * 90u) + (local_y * 120u) + wave);
        s_synth_subcap_frame[dst] = cell;
    }

    memcpy(out_mm, s_synth_subcap_frame, sizeof(s_synth_subcap_frame));
    s_synth_subcap_capture = (uint8_t)((s_synth_subcap_capture + 1u) & 0x3u);
    return (s_synth_subcap_capture == 0u);
}

#if !TOF_DEBUG_RAW_DRAW
static void tof_decay_frame(uint16_t mm[64])
{
    for (uint32_t i = 0; i < 64u; i++)
    {
        mm[i] = (uint16_t)(((uint32_t)mm[i] * 7u) / 8u);
    }
}
#endif

static void tof_update_range(const uint16_t mm[64], bool live_data)
{
#if !TOF_USE_DYNAMIC_RANGE
    (void)mm;
    (void)live_data;
    s_range_near_mm = TOF_LOCKED_NEAR_MM;
    s_range_far_mm = TOF_LOCKED_FAR_MM;
    return;
#else
    if (!live_data)
    {
        s_range_near_mm = TOF_LOCKED_NEAR_MM;
        s_range_far_mm = TOF_LOCKED_FAR_MM;
        return;
    }

    uint16_t min_mm = 0xFFFFu;
    uint16_t max_mm = 0u;
    uint32_t valid_count = 0u;

