telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
    for (uint32_t i = 0u; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (!tof_mm_valid(v))
        {
            continue;
        }
        valid_count++;
        if (v < min_mm)
        {
            min_mm = v;
        }
        if (v > max_mm)
        {
            max_mm = v;
        }
    }

    if (valid_count < 4u || min_mm >= max_mm)
    {
        s_range_near_mm = TOF_LOCKED_NEAR_MM;
        s_range_far_mm = TOF_LOCKED_FAR_MM;
        return;
    }

    uint16_t pad = (uint16_t)(((uint32_t)(max_mm - min_mm) / 8u) + 20u);
    uint16_t near_mm = (min_mm > pad) ? (uint16_t)(min_mm - pad) : 0u;
    uint16_t far_mm = (uint16_t)(max_mm + pad);
    if (far_mm <= near_mm)
    {
        far_mm = (uint16_t)(near_mm + 1u);
    }

    s_range_near_mm = near_mm;
    s_range_far_mm = far_mm;
#endif
}

static int32_t tof_find_closest_idx(const uint16_t mm[64])
{
    int32_t best_idx = -1;
    uint16_t best_mm = 0xFFFFu;

    for (uint32_t i = 0; i < 64u; i++)
    {
        const uint16_t v = mm[i];
        if (v >= TOF_LOCKED_NEAR_MM && v <= TOF_LOCKED_FAR_MM && v < best_mm)
        {
            best_mm = v;
            best_idx = (int32_t)i;
        }
    }

    return best_idx;
}

static void tof_update_hotspot(const uint16_t mm[64], bool live_data)
{
    const int32_t new_hot = live_data ? tof_find_closest_idx(mm) : -1;
    if (new_hot == s_hot_idx)
    {
        return;
    }

    if (s_hot_idx >= 0)
    {
        tof_draw_outline(&s_cells[s_hot_idx], s_ui_border);
    }

    s_hot_idx = new_hot;
    if (s_hot_idx >= 0)
    {
        tof_draw_outline(&s_cells[s_hot_idx], s_ui_hot);
    }
}

#if !TOF_DEBUG_RAW_DRAW
static void tof_make_fallback_frame(uint16_t out_mm[64], uint32_t tick)
{
    for (uint32_t y = 0; y < TOF_GRID_H; y++)
    {
        for (uint32_t x = 0; x < TOF_GRID_W; x++)
        {
            uint32_t idx = y * TOF_GRID_W + x;
            uint32_t v = (x * 211u) + (y * 149u) + (tick * 47u);
            v = (v % 1800u) + 200u;
            out_mm[idx] = (uint16_t)v;
        }
    }
}

static void tof_draw_heatmap_incremental(const uint16_t mm[64], bool live_data)
{
    tof_filter_frame(mm, live_data);
    tof_spatial_postprocess(s_filtered_mm, live_data);
    tof_compose_display_frame(live_data);
    if (s_ai_runtime_on)
    {
        uint16_t denoised[64];
        uint16_t repaired[64];
        tof_ai_denoise_heatmap_frame(s_display_mm, denoised, live_data);
        tof_fill_display_holes(denoised, repaired);
        memcpy(s_display_mm, repaired, sizeof(repaired));
    }
    else
    {
        s_ai_grid_noise_mm = 0u;
    }
    tof_repair_corner_blindspots(s_display_mm);
    tof_update_range(s_display_mm, live_data);
    if (s_ai_runtime_on && live_data)
    {
        (void)tof_calc_roll_curve_distance_mm(s_display_mm, s_curve_pick_idx);
    }
    else
    {
        for (uint32_t y = 0u; y < TOF_GRID_H; y++)
        {
            s_curve_pick_idx[y] = -1;
        }
    }

    for (uint32_t idx = 0; idx < 64u; idx++)
    {
        const tof_cell_rect_t *c = &s_cells[idx];
        const uint16_t color = tof_color_from_mm(s_display_mm[idx], s_range_near_mm, s_range_far_mm);

        if (!s_cell_drawn[idx] || s_last_cell_color[idx] != color)
        {
            display_hal_fill_rect(c->ix0, c->iy0, c->ix1, c->iy1, color);
            s_last_cell_color[idx] = color;
            s_cell_drawn[idx] = true;
        }
    }

    const uint32_t corner_idx = (TOF_GRID_H - 1u) * TOF_GRID_W;
    const tof_cell_rect_t *corner = &s_cells[corner_idx];
    const uint16_t corner_color = tof_color_from_mm(s_display_mm[corner_idx], s_range_near_mm, s_range_far_mm);
    display_hal_fill_rect(corner->ix0, corner->iy1, corner->ix0, corner->iy1, corner_color);

    tof_update_hotspot(s_display_mm, live_data);
    tof_draw_curve_pick_overlay(s_ai_runtime_on && live_data);
}
#endif

#if TOF_DEBUG_RAW_DRAW
static void tof_draw_heatmap_raw(const uint16_t mm[64], bool live_data)
{
    uint16_t draw_mm[64];
    if (s_ai_runtime_on)
    {
        uint16_t repaired[64];
        tof_ai_denoise_heatmap_frame(mm, draw_mm, live_data);
        tof_fill_display_holes(draw_mm, repaired);
        memcpy(draw_mm, repaired, sizeof(repaired));
    }
    else
    {
        tof_fill_display_holes(mm, draw_mm);
        s_ai_grid_noise_mm = 0u;
    }
    tof_repair_corner_blindspots(draw_mm);
    tof_update_range(draw_mm, live_data);
    if (s_ai_runtime_on && live_data)
    {
        (void)tof_calc_roll_curve_distance_mm(draw_mm, s_curve_pick_idx);
    }
    else
    {
        for (uint32_t y = 0u; y < TOF_GRID_H; y++)
        {
            s_curve_pick_idx[y] = -1;
        }
    }

    for (uint32_t idx = 0; idx < 64u; idx++)
    {
        const tof_cell_rect_t *c = &s_cells[idx];
        const uint16_t color = tof_color_from_mm(draw_mm[idx], s_range_near_mm, s_range_far_mm);

        if (!s_cell_drawn[idx] || s_last_cell_color[idx] != color)
        {
            display_hal_fill_rect(c->ix0, c->iy0, c->ix1, c->iy1, color);
            s_last_cell_color[idx] = color;
            s_cell_drawn[idx] = true;
        }
    }

    const uint32_t corner_idx = (TOF_GRID_H - 1u) * TOF_GRID_W;
    const tof_cell_rect_t *corner = &s_cells[corner_idx];
    const uint16_t corner_color = tof_color_from_mm(draw_mm[corner_idx], s_range_near_mm, s_range_far_mm);
    display_hal_fill_rect(corner->ix0, corner->iy1, corner->ix0, corner->iy1, corner_color);

    tof_update_hotspot(draw_mm, live_data);
    tof_draw_curve_pick_overlay(s_ai_runtime_on && live_data);
}
#endif

int main(void)
{
    BOARD_InitHardware();

    if (!display_hal_init())
    {
        for (;;) {}
    }

    bool tof_ok = true;
#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
    tof_ok = tmf8828_quick_init();
    PRINTF("TOF demo: TMF8828 %s\r\n", tof_ok ? "ready" : "fallback mode");
#elif (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_SYNTH_FIXED)
    PRINTF("TOF demo: synthetic fixed-frame mode enabled\r\n");
#elif (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_SYNTH_SUBCAP)
    PRINTF("TOF demo: synthetic 4-subcapture mode enabled (map=%u)\r\n", (unsigned)TOF_SYNTH_MAP_MODE);
#else
    PRINTF("TOF demo: invalid TOF_DEBUG_INPUT_MODE=%u\r\n", (unsigned)TOF_DEBUG_INPUT_MODE);
    tof_ok = false;
#endif
#if TOF_DEBUG_RAW_DRAW
    PRINTF("TOF demo: raw draw mode enabled (no smoothing/persistence/fallback)\r\n");
#endif

    tof_ui_init();
    tof_touch_init();
    memset(s_synth_subcap_frame, 0, sizeof(s_synth_subcap_frame));
    s_synth_subcap_capture = 0u;

    uint16_t frame_mm[64] = {0};
    uint32_t tick = 0u;
    bool have_live = false;
    uint32_t stale_frames = 0u;
    bool printed_live_once = false;
    bool printed_timeout_once = false;
    bool restart_attempted = false;
    uint32_t zero_live_frames = 0u;
    uint32_t zero_restart_cooldown = 0u;
    bool had_nonzero_frame = false;
    uint32_t TOF_UNUSED synth_complete_count = 0u;
    uint32_t last_draw_tick = 0u;
    bool have_drawn_frame = false;

    uint16_t boot_roll_mm[64];
    for (uint32_t i = 0u; i < 64u; i++)
    {
        boot_roll_mm[i] = TOF_TP_MM_FULL_NEAR;
    }
    s_tp_force_redraw = true;
    tof_update_spool_model(boot_roll_mm, false, tick, true);
    s_tp_force_redraw = true;

    for (;;)
    {
        bool got_live = false;
        bool got_complete = false;
        uint16_t complete_frame_mm[64];
        bool have_complete_frame = false;
        if (tof_ok)
        {
#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
            for (uint32_t burst = 0u; burst < TOF_READ_BURST_MAX; burst++)
            {
                bool packet_complete = false;
                if (!tmf8828_quick_read_8x8(frame_mm, &packet_complete))
                {
                    break;
                }
                got_live = true;
                if (packet_complete)
                {
                    memcpy(complete_frame_mm, frame_mm, sizeof(complete_frame_mm));
                    have_complete_frame = true;
                }
            }
            got_complete = have_complete_frame;
            if (have_complete_frame)
            {
                memcpy(frame_mm, complete_frame_mm, sizeof(complete_frame_mm));
            }
#elif (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_SYNTH_FIXED)
            tof_fill_synth_fixed(frame_mm, tick);
            got_live = true;
            got_complete = true;
#elif (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_SYNTH_SUBCAP)
            got_complete = tof_fill_synth_subcap(frame_mm, tick);
            got_live = true;
#else
            got_live = false;
            got_complete = false;
#endif
        }

        if (got_live)
        {
            const uint32_t valid_count = tof_count_valid(frame_mm);
            have_live = true;
            stale_frames = 0u;
            printed_timeout_once = false;
            restart_attempted = false;

            if (valid_count == 0u)
            {
                if (had_nonzero_frame)
                {
                    if (zero_live_frames < 1000000u)
                    {
                        zero_live_frames++;
                    }
                }
                else
                {
                    zero_live_frames = 0u;
                }

                if (zero_restart_cooldown > 0u)
                {
                    zero_restart_cooldown--;
                }
            }
            else
            {
                had_nonzero_frame = true;
                zero_live_frames = 0u;
                zero_restart_cooldown = 0u;
            }

            if (!printed_live_once)
            {
                PRINTF("TOF demo: live 8x8 frames detected\r\n");
                printed_live_once = true;
            }

#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_SYNTH_SUBCAP)
            if (got_complete)
            {
                synth_complete_count++;
                if ((synth_complete_count % TOF_SYNTH_TRACE_EVERY_COMPLETE) == 0u)
                {
                    tof_trace_quadrant_means(frame_mm, synth_complete_count);
                }
            }
#endif

#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
            if (TOF_ENABLE_AUTO_RECOVERY)
            {
            if (tof_ok &&
                zero_live_frames >= TOF_ZERO_FRAME_RESTART_FRAMES &&
                zero_restart_cooldown == 0u)
            {
                PRINTF("TOF demo: zero-valid frame streak, restarting stream\r\n");
                if (!tmf8828_quick_restart_measurement())
                {
                    PRINTF("TOF demo: zero-valid restart failed\r\n");
                }
                zero_restart_cooldown = TOF_ZERO_FRAME_RESTART_COOLDOWN_FRAMES;
            }

            if (tof_ok &&
                zero_live_frames >= TOF_ZERO_FRAME_REINIT_FRAMES)
            {
                PRINTF("TOF demo: persistent zero-valid frames, reinitializing sensor\r\n");
                tof_ok = tmf8828_quick_init();
                PRINTF("TOF demo: TMF8828 %s\r\n", tof_ok ? "ready" : "fallback mode");
                stale_frames = 0u;
                printed_live_once = false;
                have_live = false;
                restart_attempted = false;
                zero_live_frames = 0u;
                zero_restart_cooldown = 0u;
                had_nonzero_frame = false;
            }
            }
#endif
        }
        else
        {
            if (stale_frames < TOF_REINIT_LIMIT_FRAMES)
            {
                stale_frames++;
            }

            if (stale_frames >= TOF_STALE_LIMIT_FRAMES)
            {
                if (have_live)
                {
                    PRINTF("TOF demo: live stream timeout, waiting for stream\r\n");
                }
                have_live = false;
                if (!printed_timeout_once)
                {
                    printed_timeout_once = true;
                }
            }

