telespial/EdgeAI_3D_Printer_Spool_Size_ToF_demo_NXP_FRDM-MCXN947/src/tof_demo.c
            if (tof_ok && stale_frames >= TOF_RESTART_LIMIT_FRAMES && !restart_attempted)
            {
#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
                if (TOF_ENABLE_AUTO_RECOVERY)
                {
                    restart_attempted = true;
                    if (!tmf8828_quick_restart_measurement())
                    {
                        PRINTF("TOF demo: stream restart failed\r\n");
                    }
                }
#endif
            }
        }

        bool draw_now = false;

        if (!tof_ok)
        {
#if TOF_DEBUG_RAW_DRAW
            memset(frame_mm, 0, sizeof(frame_mm));
            draw_now = true;
#else
            tof_make_fallback_frame(frame_mm, tick);
            draw_now = true;
#endif
        }
        else if (!have_live)
        {
#if TOF_DEBUG_RAW_DRAW
            /* Keep last frame visible during transient live gaps to avoid
             * full-screen blank/wipe flashes.
             */
            draw_now = true;
#else
            tof_decay_frame(frame_mm);
            draw_now = true;
#endif
        }
        else if (
#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
            (TOF_DRAW_ON_COMPLETE_ONLY ? got_complete : (got_live || got_complete))
#else
            (got_live || got_complete)
#endif
        )
        {
            draw_now = true;
        }
        else if (got_live)
        {
            const uint32_t draw_gap =
                have_drawn_frame ? (uint32_t)(tick - last_draw_tick) : TOF_MAX_DRAW_GAP_TICKS;
            if (draw_gap >= TOF_MAX_DRAW_GAP_TICKS)
            {
                draw_now = true;
            }
        }

        if (tof_ok && stale_frames >= TOF_REINIT_LIMIT_FRAMES)
        {
#if (TOF_DEBUG_INPUT_MODE == TOF_INPUT_MODE_LIVE)
            if (TOF_ENABLE_AUTO_RECOVERY)
            {
                PRINTF("TOF demo: prolonged timeout, reinitializing sensor\r\n");
                tof_ok = tmf8828_quick_init();
                PRINTF("TOF demo: TMF8828 %s\r\n", tof_ok ? "ready" : "fallback mode");
                stale_frames = 0u;
                printed_live_once = false;
                have_live = false;
                restart_attempted = false;
                zero_live_frames = 0u;
                zero_restart_cooldown = 0u;
                had_nonzero_frame = false;
            }
#endif
        }

        const bool popup_visible = s_alert_runtime_on && s_alert_popup_active;

        if (draw_now && !popup_visible)
        {
#if TOF_DEBUG_RAW_DRAW
            const bool raw_live = (tof_ok && got_live);
            tof_draw_heatmap_raw(frame_mm, raw_live);
#else
            tof_draw_heatmap_incremental(frame_mm, have_live);
#endif
            last_draw_tick = tick;
            have_drawn_frame = true;
        }

        tof_touch_poll_ai_toggle(tick);
        const bool model_live = (tof_ok && have_live);
        tof_update_spool_model(frame_mm, model_live, tick, !popup_visible);
        if (!popup_visible)
        {
            tof_update_debug_panel(frame_mm,
                                   model_live,
                                   got_live,
                                   got_complete,
                                   stale_frames,
                                   zero_live_frames,
                                   tick);
        }
        tof_update_roll_alert_ui(s_roll_fullness_q10, model_live, tick);

        tick++;
        SDK_DelayAtLeastUs(TOF_FRAME_US, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }
}
